[{"link": "https://sa.indeed.com/rc/clk?jk=97e4b19d63954cf8&fccid=f831bb550399f7c1&vjs=3", "location": "Riyadh", "title": "Senior BackEnd Developer - Python", "company": "Zid", "salary": NaN, "desc": "Company Description\n\nWho we are?\n\nBecome a Zider Tech member and join this amazing company that is on top of the e-commerce game! Join a company that is not only growing but having fun while doing it. We are a human centric organization with huge growth plans and with a purpose to help more and more people with little or no digital experience to start their online business (e-commerce), move their offline to online or grow their offline businesses even more by having an online presence.\nWhere are we coming from and where are we going?\nZid has had a tremendous grow over the last 5 years. From 5 people to 300+ people at present and counting. Our revenues have been increasing more than 3 times year on year and we have had a great success. We know that huge growth brings a few complications and challenges to our technology and we, in engineering, are aware of them and we are looking to solve those. We are an e-commerce SaSS platform, a fintech startup, a logistics and shipping consolidator and we understand and believe that technology and business go hand-in-hand.\n\nJob Description\n\nAs a Senior BackEnd Developer you should be passionate for delivering high quality products and features, be a team player, think outside of the box, have high experience and knowledge in the technology we use (and why not others too!) and be a good communication. We are a product oriented organization with a strong passion for Engineering and innovation.\nSome of your responsibilities\nWork closely with product managers and other team members to drive the delivery of projects, new features and support on the L2 for incident management.\nGuide other more junior in knowledge team members to ensure they become better and more efficient themselves in the art of coding.\nWork on your time management skills to ensure that we can estimate tasks and work effort for the work being required by each product line.\nSupport and actively contribute to the collaborative development workflows (source control, branches, PRs) and continuous deployment practices.\nBe part of the daily stand-ups that are done with product manager.\nHelp with peer source code review\nBe part of the retrospective sessions to ensure that we not only do continuous. integration and continuous deployment but also continuous improvements on the way we work as a team!\n\nQualifications\n\nHard Skills\nA background studies in Computer Science or similar.\nAt least 4 years of hands-on experience in Python and Django web framework or similar web development stack.\nA strong hands-on experience in model-template-view architectures.\nA strong hands-on experience in SOLID and software engineering best practices.\nHands-on experience in writing efficient and useful unit tests.\nExperience using PostgreSQL.\nExperience with Redis cache system and how to make cache more efficient in its use.\nExperience in building REST APIs.\nProficient in Linux command-line.\nKnowledge of Solution Architecture and how to build more cost-effective and efficient systems/platforms/services.\nHigh understanding of monolithic modular platforms.\nKnowing or having worked in the e-commerce, retail digital space, or couriers is a big plus.\nHaving worked with JIRA and Notion is a plus.\nKnowledge or having work in an Agile environment with SCRUM or Kanban practices is a plus.\nSoft Skills\nGreat communication skills.\nTeam player.\nAttention to detail.\nExcellent debugging and problem-solving skills.\nExcellent communication skills, both written and verbal.\nSmart working habits!\nAbility to at point work under pressure (doesn’t happen often but sometimes we have deadlines!).\nSeek the highest quality and aim to build a “bugs-free software even though we understand and know there is no such thing in real life.\nHave a clean coding standards to avoid creating waste.\n\nAdditional Information\n\nWhat are we offering?\nCompetitive Salary\nHolidays of 21 days + additional days given regularly\nTrainings (we kicked the learning internally and recently completed an AWS Architecting course)\nCareer path clearly defined!\nZEA – Zid Entertainment – Fun Thursdays!"}, {"link": "https://sa.indeed.com/rc/clk?jk=553f2002ecb39fd5&fccid=5621890a4e9f96fa&vjs=3", "location": "Riyadh", "title": "Senior Backend Developer", "company": "Professional Recruitment", "salary": NaN, "desc": "Responsibilities:\nExperienced backend developer (python) to help us create a dynamic and challenging platform.\nResponsible for writing and testing scalable code, developing back-end components, and integrating user-facing elements in collaboration with front-end developers.\nAs a backend developer, you should possess in-depth knowledge of object-relational mapping, experience with server-side logic, and superior knowledge of Python programming.\nCoordinating with development teams to determine application requirements.\nWriting scalable code using Python programming language.\nTesting and debugging.\nDeveloping scalable back-end components.\nIntegrating user-facing elements using server-side logic.\nIntegrating data storage solutions.\n\nOther Requirements:\nBachelor's degree in computer science, computer engineering, or related field.\nAt least 5 years of experience as a Python developer with Expert knowledge of Python and related frameworks such as Django.\nSense of ownership and pride in your performance and its impact on company’s success.\nCritical thinker and problem-solving skills.\nTeam player, good time-management skills and effective communication skills."}, {"link": "https://sa.indeed.com/rc/clk?jk=0fee74648bf7ac0e&fccid=f831bb550399f7c1&vjs=3", "location": "Riyadh", "title": "Senior BackEnd Developer - Laravel", "company": "Zid", "salary": NaN, "desc": "Company Description\n\nZid is an e-commerce in a box - solution that any retailer can use to start their eRetail. Zid helps them to build their own E-Stores (with their own name and identity) and integrates them with the supply chain players to enable them to manage and with ease. All of that with affordable cost and decent quality.\nWebsite: http://zid.sa LinkedIn:\nhttps://www.linkedin.com/company/zidapp\nLocation: Riyadh, Saudi Arabia\nIndustry: Technology, Information and Internet\nCompany size: 250+ employees\n\nJob Description\n\nWork closely with Product owners and other team members to drive the delivery of projects, new features and support on the L2 for incident management.\nGuide other more junior in knowledge team members to ensure they become better and more efficient themselves in the art of coding.\nWork on your time management skills to ensure that we can estimate tasks and work effort for the work being required by each product line\nSupport and actively contribute to the collaborative development workflows (source control, branches, PRs) and continuous deployment practices\nBe part of the daily standups that are done with product\nHelp with peer source code review\nBe part of the retrospective sessions to ensure that we not only do continous integration and continuous deployment but also continuous improvements on the way we work as a team!\nBe part of this amazing Ziders team!\n\nQualifications\n\nA background studies in Computer Science or similar\nAt least 4 years of hands-on experience in PHP and Laravel frameworks or similar web development stack\nA strong hands-on experience in model-view-controller architectures\nA strong hands-on experience in SOLID and software engineering best practices\nHands-on experience in writing efficient and useful unit tests with PHPUnit framework\nExperience using MySQL\nExperience with REDIS cache system and how to make cache more efficient in its use\nExperience in building REST APIs\nProficient in Linux command-line\nKnowledge of Solution Architecture and how to build more cost-effective and efficient systems/platforms/services\nHigh understanding of monolithic modular platforms\nKnowing or having worked in the e-commerce, retail digital space is a big plus\nHaving worked with JIRA and Notion is a plus\nKnowledge or having work in an Agile environment with SCRUM or Kanban practices is a plus\n\nSoft Skills:\nGreat communication skills\nTeam player\nAttention to detail\nExcellent debugging and problem-solving skills\nExcellent communication skills, both written and verbal.\nSmart working habits!\nAbility to at point work under pressure (doesn’t happen often but sometimes we have deadlines!)\nSeek the highest quality and aim to build a “bugs-free software even though we understand and know there is no such thing in real life\nHave a clean coding standards to avoid creating waste\n\nAdditional Information\n\nWhat do we offer:\nGreat environment and people to work with\nThursday’s 4pm fun hour! -> topics in which teams discuss different topics or we have special guests providing a topic of conversation\nFlexible working hours\nHybrid, physical or remote -> you choose! (for people not in Riyadh, Saudi Arabia, full remote!!)\nCompetitive salary package\nTechnology equipment according to the needs of the role (fancy!)\nRegular training (train the trainers or actual training provided by organizations)\nOur current technology stack is composed of: PHP, Pyton, .NET, Django, Javascript, Vuejs, Typescript, Bootstrap, JAVA, jQuery, MySQL, Redis, ELK, NodeJS, Django, among others."}, {"link": "https://sa.indeed.com/rc/clk?jk=2c4d6cc1ac41b2b3&fccid=16a37eddfee06e0f&vjs=3", "location": "Riyadh", "title": "SRE Manager, Cloud Platform", "company": "Lucid Motors", "salary": NaN, "desc": "Leading the future in luxury electric and mobility\nAt Lucid, we set out to introduce the most captivating, luxury electric vehicles that elevate the human experience and transcend the perceived limitations of space, performance, and intelligence. Vehicles that are intuitive, liberating, and designed for the future of mobility.\nWe plan to lead in this new era of luxury electric by returning to the fundamentals of great design – where every decision we make is in service of the individual and environment. Because when you are no longer bound by convention, you are free to define your own experience.\nCome work alongside some of the most accomplished minds in the industry. Beyond providing competitive salaries, we’re providing a community for innovators who want to make an immediate and significant impact. If you are driven to create a better, more sustainable future, then this is the right place for you.\n\nThe Cloud Platform team at Lucid is currently seeking a Site Reliability Engineering Manager. In this position, the individual will be involved in managing a team that will be responsible for providing reliability to the Cloud Platform that enabled Lucid Motors' Cloud-based Applications on various public and private Cloud Infrastructure.\nOur ideal candidate exhibits a can-do attitude and approaches his or her work with vigor and determination. We are looking for a hands-on Software Engineering Manager, who will collaborate with internal stakeholders to work on the backend to build automation to provision and maintain the Cloud Platform.\nResponsibilities\nManage and lead the Reliability Engineering of one or more cloud services across Lucid Motors at KSA.\nCollaborate with Service Owners to define the SLOs and build SLIs to ensure systems are meeting the SLAs.\nIndulge with Developers, DevOps, Data Scientists, and Quality Engineers right from design to production to build reliable services.\nBuild tools and frameworks to automate the monitoring systems to ensure the highest level of uptime in various production-grade environments.\nManage the reliability aspects of HA big-data systems and can identify the bottlenecks at the early stages.\nManage systems that use MQTT, Message brokers for Pub-Sub, Streaming Platforms such as Kafka, Data Analytics using Spark, No-SQL databases such as Elastic Search, Influx, Mongo, Presto, Cassandra, and other open sources services.\nManage the device to cloud connectivity and troubleshoot from end to end on a private or public cloud Infrastructure.\nDeploy and maintain Services that will be globally launched - on both Public Cloud Infrastructure providers and on-prem setup - and manage the uptime and reliability.\nOptimize Incident management processes and improve operational efficiency.\nBased on the customer impact, prioritizes the workload between features development and customer support.\nCreate a 24/7 service availability model to proactive monitor the systems to keep up with SLAs.\nParticipate in agile and scrum best practices and strive for continuous integration and delivery (CI-CD).\nWork with Product Owners and other team members from requirements gathering to developing a cloud platform that can launch services with a single click.\nTake appropriate actions by doing impact analysis during the incidents.\nHiring and building SRE organization from the ground up.\nRequirements\nB.S. or M.S. degree in Computer Science, Engineering, OR equivalent work experience.\n5+ years of experience in SRE or DevOps Engineering.\n2-5 years of experience in managing one or more SRE teams.\n3-5 years of experience in managing large-scale data analytics platforms that use Spark, Storm, or other frameworks.\n1-3 years of experience deploying and maintaining applications that are built using Docker and orchestrated on Kubernetes on Public or Private Cloud Providers.\n1-3 years of experience using Cloud Automation tools such as Terraform, Cluster API, or other frameworks.\n1-3 years of experience in Programing or scripting languages using Python, Go, Bash/Shell, or others.\n1-3 years of administrative operations knowledge in RDBMS such as Postgres and no-SQL such as Cassandra, MongoDB, or others\nShow experience in hiring and building high-performant SRE teams.\nShow the traits of being detail-oriented with strong time management and organization skills, and dedication to quality.\nExperienced with various debugging tools and troubleshooting performance bottlenecks at the infrastructure or at the application tier.\nGood to have experience with Config Management and automation using Ansible, Chef, Puppet, or others.\nExperienced with various Networking challenges and able to resolve networking bottlenecks at peak load.\nGood to have the knowledge of REST-based APIs and knows how to triage the request-response.\nAt Lucid, we don’t just welcome diversity - we celebrate it! Lucid Motors is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations.\n\nNotice regarding COVID-19 protocols\nAt Lucid, we prioritize the health and wellbeing of our employees, families, and friends above all else. In response to the novel Coronavirus all new Lucid employees, whose job will be based in the United States may or may not be required to provide original documentation confirming status as having received the prescribed inoculation (doses). Vaccination requirements are dependent upon location and position, please refer to the job description for more details.\nIndividuals in positions requiring vaccinations may seek a medical and/or religious exemption from this requirement and may be granted such an accommodation after submitting a formal request to and the subsequent review and approval thereof by our dedicated Covid-19 Response team.\nTo all recruitment agencies: Lucid Motors does not accept agency resumes. Please do not forward resumes to our careers alias or other Lucid Motors employees. Lucid Motors is not responsible for any fees related to unsolicited resumes."}, {"link": "https://sa.indeed.com/rc/clk?jk=2850b8818d6bb20e&fccid=68467f8543d168c0&vjs=3", "location": "Riyadh", "title": "Developer", "company": "Encore Theme", "salary": NaN, "desc": "Riyadh, Saudi Arabia\nTech Hiring\n2858154\nJob Description\n\nRole Purpose\nThe purpose of this role is to design, test and maintain softwareprograms for operating systems or applications which needs to bedeployed at a client end and ensure its meet 100% quality assuranceparameters\n\nDo\n\nInstrumental in understanding the requirements and design ofthe product/ software\nDevelop software solutions by studying information needs,studying systems flow, data usage and work processes\nInvestigating problem areas followed by the software developmentlife cycle\nFacilitate root cause analysis of the system issues and problemstatement\nIdentify ideas to improve system performance and impactavailability\nAnalyze client requirements and convert requirements to feasibledesign\nCollaborate with functional teams or systems analysts who carryout the detailed investigation into software requirements\nConferring with project managers to obtain information onsoftware capabilities\nPerform coding and ensure optimal software/ moduledevelopment\nDetermine operational feasibility by evaluating analysis,problem definition, requirements, software development and proposedsoftware\nDevelop and automate processes for software validation by setting up and designing test cases/scenarios/usage cases, andexecuting these cases\nModifying software to fix errors, adapt it to new hardware,improve its performance, or upgrade interfaces.\nAnalyzing information to recommend and plan the installation ofnew systems or modifications of an existing system\nEnsuring that code is error free or has no bugs and test failure\nPreparing reports on programming project specifications,activities and status\nEnsure all the codes are raised as per the norm defined forproject / program / account with clear description and replicationpatterns\nCompile timely, comprehensive and accurate documentation andreports as requested\nCoordinating with the team on daily project status and progressand documenting it\nProviding feedback on usability and serviceability, trace theresult to quality risk and report it to concerned stakeholders\nStatus Reporting and Customer Focus on an ongoing basis withrespect to project and its execution\nCapturing all the requirements and clarifications from theclient for better quality work\nTaking feedback on the regular basis to ensure smooth and ontime delivery\nParticipating in continuing education and training to remaincurrent on best practices, learn new programming languages, and betterassist other team members.\nConsulting with engineering staff to evaluate software-hardwareinterfaces and develop specifications and performance requirements\nDocument and demonstrate solutions by developing documentation,flowcharts, layouts, diagrams, charts, code comments and clear code\nDocumenting very necessary details and reports in a formal wayfor proper understanding of software from client proposal toimplementation\nEnsure good quality of interaction with customer w.r.t. e-mailcontent, fault report tracking, voice calls, business etiquette etc\nTimely Response to customer requests and no instances ofcomplaints either internally or externally\n\nStakeholder Interaction\n\nStakeholder Type\n\nStakeholder Identification\n\nPurpose of Interaction\n\nInternal\n\nLead Software Developer and Project Manager\n\nRegular reporting & updates\n\nSoftware Developers\nFor work coordination and support in providing testing solutions\n\nExternal\n\nClients\n\nProvide apt solutions and support as per the requirement\n\nDisplay\n\nLists the competencies required to perform this role effectively:\nFunctional Competencies/ Skill\nLeveraging Technology – Knowledge of current and upcomingtechnology along with expertise in programming (automation, tools andsystems) to build efficiencies and effectiveness in own function/ Clientorganization – Competent\nProcess Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk – Expert\nTechnical knowledge – knowledge of various programminglanguages, tools, quality management standards and processes - Expert\n\nCompetency Levels\n\nFoundation\n\nKnowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance.\n\nCompetent\n\nConsistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well.\n\nExpert\n\nApplies the competency in all situations and is serves as a guideto others as well.\n\nMaster\n\nCoaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognised within the entire organization.\n\nBehavioral Competencies\nFormulation & Prioritization\nInnovation\nManaging Complexity\nExecution Excellence\nPassion for Results\n\nDeliver\n\nNo.\n\nPerformance Parameter\n\nMeasure\n\n1.\n\nContinuous Integration, Deployment & Monitoring of Software\n\n100% error free on boarding & implementation, throughput %,Adherence to the schedule/ release plan\n\n2.\n\nQuality & CSAT\n\nOn-Time Delivery, Manage software, Troubleshoot queries\nCustomer experience, completion of assigned certifications for skillupgradation\n\n3.\n\nMIS & Reporting\n\n100% on time MIS & report generation\n\nJava Backend Developer\n\nJava & Java frameworks - Java 1.8, Design Patterns, Spring (Core, MVC, Core, Security, Data), Struts\nSpringboot and Microservices architecture with RESTful Webservices\nWeb Services / Tools – Restful Services, SOAP/XML, JAX WS\nBuild & automation tools – Maven, Jenkins\nSource control tools – GitHub or Bit Bucket"}]