[{"link": "https://sa.indeed.com/rc/clk?jk=02e091c1362581da&fccid=b7c2b45e2f6dc3fb&vjs=3", "location": "Dammam", "title": "Chemist", "company": "Element Materials Technology", "salary": NaN, "desc": "Overview:\nElement has an opportunity for a Chemistry Technician for testing, sample preparation and delivery/collection of samples and preparation of test reports\n\nThis position will be based in Dammam , KSA\n\nResponsibilities:\nAnalysis of water, soil, aggregates, concrete and scale samples ,operating of equipments like pH / EC / TDS meters, UV-visible spectrophotometers, ovens, furnaces, incubators, fusion machines\nPreparation of reagents, standard solution and ensure standardisation of the solution used in the laboratory and handling and storage all chemicals as per the Material Safety Data Sheet (MSDS)\nManaging the calibration of glass wares and the instruments\nPerformance of qualitative and quantitative laboratory tests and analysis of other substances as per standard method and issuing reports and receive samples to and from the respective entities\nInvolvement in site and field testing with various international standards or in-house procedures , while ensuring work compliance to ISO 17025 requirements\nGeneral maintenance, cleaning and checking of equipment while working to all HSE standards\nInteraction with clients during witnessed testing and driving to customer site to collect samples and / or conduct testing at their lab when required\nSkills / Qualifications:\nHave a diploma / degree in chemistry with at least 2 years experience in similar role\nHave the ability to work in teams under pressure and flexible to work different working hours (night / day) shifts if required or necessary\nGood English communication skills: reading, writing, speaking along with good maths skills\nThis is a Saudi national position\n#LI-SR1\nCompany Overview:\nElement is one of the fastest growing testing, inspection and certification businesses in the world. Globally we have more than 6,500 brilliant minds operating from 200 sites across 30 countries. Together we share an ambitious purpose to ‘Make tomorrow safer than today’.\n\nWhen failure in use is not an option, we help customers make certain that their products, materials, processes and services are safe, compliant and fit for purpose. From early R&D, through complex regulatory approvals and into production, our global laboratory network of scientists, engineers, and technologists support customers to achieve assurance over product quality, sustainable outcomes, and market access.\n\nWhile we are proud of our global reach, working at Element feels like being part of a smaller company. We empower you to take charge of your career, and reward excellence and integrity with growth and development.\n\nIndustries across the world depend on our care, attention to detail and the absolute accuracy of our work. The role we have to play in creating a safer world is much bigger than our organization.\nDiversity Statement:\nAt Element, we always take pride in putting our people first. We are an equal opportunity employer that recognizes diversity and inclusion as fundamental to our Vision of becoming “the world’s most trusted testing partner”.\n\nAll suitably qualified candidates will receive consideration for employment on the basis of objective work related criteria and without regard for the following: age, disability, ethnic origin, gender, marital status, race, religion, responsibility of dependents, sexual orientation, or gender identity or other characteristics in accordance with the applicable governing laws."}, {"link": "https://sa.indeed.com/rc/clk?jk=3e401a8fae952795&fccid=36028905bb7e7da7&vjs=3", "location": "Dammam", "title": "Data Scientist", "company": "Halian", "salary": NaN, "desc": "Our Client\nWe are partnered with one of the largest Technology organizations globally.\nOn their behalf we are looking for a Data Scientist to deliver one of their long-term projects with an end-customer in Dammam.\nYour Responsibilities\nConnect people processes & outcomes with data, driving a data-first culture in marketing.\nTransform data into actionable insights for impactful decision making.\nDemocratize data science by advocating for use of AI/ML solutions and equip marketing for its future.\nEmpower explainable AI to build trust and confidence in decisions and actions.\nYour Qualifications\nBachelors/Masters/PhD degree in a quantitative discipline/technical field\n8-10 years experience leading and/or participating in data science/data analytics projects end to end\nProficiency in programming language (R/Python etc.) and database manipulation using SQL\nExperience with statistical data analysis and data science techniques; Data visualization and Data storytelling\nExperience in articulating and educating technical & complex processes to a variety of non-technical audiences, bridging between technical and business.\nExperience in end-to-end deployment of data science/ML applications\nDemonstrable experience with designing and simplifying complex processes and implementing them with a well-defined rhythm and rigor\nA keen understanding of technology business\nHalian Group\nWith over 20 years of experience, we have come to understand that innovation is the only way to provide agile, practical solutions that transform businesses and careers.\nOur resourcing and smart services help you to realize tomorrow’s potential. Discover the amazing things possible when you bring the right people and the right technologies together."}, {"link": "https://sa.indeed.com/rc/clk?jk=1d4c0afb83c80aa2&fccid=a8de1e8b93794ec6&vjs=3", "location": "Dammam", "title": "Research Scientist", "company": "King Fahd University of Petroleum & Minerals", "salary": NaN, "desc": "The Applied Research Center for Environment & Marine Studies in the King Fahd University of Petroleum and Minerals, Dhahran, Kingdom of Saudi Arabia is looking for an enthusiastic and skilled numerical ocean modeler to consolidate, develop, and expand our present expertise in Hydrodynamic modeling. As part of an interdisciplinary cross-campus team, the modeler will use ROMS/POM, as well as available data, to characterize the transport and variability in the Red Sea and Arabian Gulf. The modeling will potentially encompass dispersal (biota, oil, and sediment), biological productivity, biogeochemical transformation, and physical processes of critical importance to past, present and future states of these oceanic domains. This may require the application of other relevant modeling systems. The modeler will also be involved in the development of operational applications for ROMS. This position will also require a broad understanding of physical oceanography and numerical ocean modeling. Global and basin-scale versions of the Hybrid Coordinate Ocean Model will be utilized extensively, so experience with HYCOM would be beneficial, but not essential. Strong computing skills, including numerical modeling and coding experience. For more information about the department, please visit:\n\nhttps://cew.kfupm.edu.sa/Default\n\nJob Responsibility\nThe successful candidate will be a team player who is comfortable working in a multidisciplinary team environment. They should be self-motivated and results-orientated, showing initiative whilst being well-organized, conscientious and working productively with a range of staff across CEW’s sites. Candidates will also need good communication and presentation skills and a strong track record in publishing research. The candidate is expected to conduct multidisciplinary projects at the planning, development and implementation phases.\n\nCompensation & Benefits\nCompetitive salary based on qualifications and experience. The appointment includes the following benefits according to the university policy.\n1. Tax free salary.\n2. Free furnished air-conditioned on-campus housing unit with free essential utilities and maintenance.\n3. Air ticket/s to Dhahran on appointment.\n4. Annual repatriation air ticket/s for family members up to four persons.\n5. 30 days of paid vacation.\n6. Assistance with local tuition fees for school-aged dependent children.\n7. Transportation allowance\n8. Free health care at KFUPM Clinic\n9. End-of-service gratuity after two (2) years of continuous service.\nThe KFUPM campus has a range of facilities including a medical and dental clinic, health club with swimming pool, an extensive library, computing, researc\n\nQualifications\nApplicants must have a Doctoral degree in ocean engineering, oceanography and/or numerical ocean modelling; candidates should have experience in modelling oceanic processes with POM/ROMS and modern analytical methods for analyzing ocean model output and datasets. Knowledge and experience with other modelling systems such as oil spill and sedimental dispersion, WRF would be an advantage. They should also have strong analytical skills; Strong computing skills (Windows, Linux, Fortran, and a scientific scripting language such as Matlab or Python), including numerical modeling, hydrodynamic systems and coding experience.\n\nSpecial Instructions to Applicants\n1. Applications are invited for faculty positions as soon as possible at King Fahd University of Petroleum & Minerals, Dhahran, Saudi Arabia.\n2. Applicants must be fluent in English as it is the medium of instruction in the University.\n3. A strong track record of research and of handling projects independently.\n\nContact Information\nDirector of Talent Acquisition Department\nKing Fahd University of Petroleum & Minerals\nKFUPM Box 5005, Dhahran 31261\nSaudi Arabia\nEmail: faculty@kfupm.edu.sa\nTelephone: +966 13 860-7854\nFax: +966 13 860-2442\n\nOpen Date\n06/25/2022\n\nClose Date\n\nOpen Until Filled\nYes"}, {"link": "https://sa.indeed.com/rc/clk?jk=e8013b5fc2044550&fccid=b7c2b45e2f6dc3fb&vjs=3", "location": "Dammam", "title": "Administrator", "company": "Element Materials Technology", "salary": NaN, "desc": "Overview:\nElement has an opportunity for a Administrator to join our growing team\nThis is a great opportunity to develop your Administration career within a Global TIC business and in this role and in this role , you will manage administrative tasks and assist with the Reception desk as required and other associated tasks\nThis position is based in Dammam , Second Industrial area in KSA\n\nResponsibilities:\nProvide administrative support to laboratory operations and facility management while supporting the receptionist activities when required\nAssist HR Manager and Operations Managers in preparing month end reports\nCoordination of inter lab transactions – Sending LPO’s and follow up for invoices\nResponsible for arranging hotel accommodation and transportation for guests\nManage interoffice queries and ensure that there is effective communication of operational data to the management section\nSkills / Qualifications:\nIdeal candidate must be a Bachelor degree holder with good communication skills in Arabic and English\nShould have well developed skills in excel and word\nHave confident telephone manner and ready to follow flexible timing\nThis is a KSA national role\n#LI-SR1\nCompany Overview:\nElement is one of the fastest growing testing, inspection and certification businesses in the world. Globally we have more than 6,500 brilliant minds operating from 200 sites across 30 countries. Together we share an ambitious purpose to ‘Make tomorrow safer than today’.\n\nWhen failure in use is not an option, we help customers make certain that their products, materials, processes and services are safe, compliant and fit for purpose. From early R&D, through complex regulatory approvals and into production, our global laboratory network of scientists, engineers, and technologists support customers to achieve assurance over product quality, sustainable outcomes, and market access.\n\nWhile we are proud of our global reach, working at Element feels like being part of a smaller company. We empower you to take charge of your career, and reward excellence and integrity with growth and development.\n\nIndustries across the world depend on our care, attention to detail and the absolute accuracy of our work. The role we have to play in creating a safer world is much bigger than our organization.\nDiversity Statement:\nAt Element, we always take pride in putting our people first. We are an equal opportunity employer that recognizes diversity and inclusion as fundamental to our Vision of becoming “the world’s most trusted testing partner”.\n\nAll suitably qualified candidates will receive consideration for employment on the basis of objective work related criteria and without regard for the following: age, disability, ethnic origin, gender, marital status, race, religion, responsibility of dependents, sexual orientation, or gender identity or other characteristics in accordance with the applicable governing laws or other characteristics in accordance with the applicable governing laws."}, {"link": "https://sa.indeed.com/rc/clk?jk=939bb390f0551031&fccid=e1614bd9cc003382&vjs=3", "location": "Jeddah", "title": "Data Scientist", "company": "Salla", "salary": NaN, "desc": "We are looking for a Data Scientist to design and develop Machine Learning (ML) models in different domains to find patterns from wide-variety types and large amounts of datasets. You will use mainly Deep Learning techniques (and other ML techniques) to solve different problems in Recommendation Engines, Chatbots, Natural Language Processing (NLP) and other domains. We will rely on you to build data products to extract valuable business insights. In this role, you should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research. Your goal will be to help our company analyze trends to make better decisions.\n\nResponsibilities\nAnalyze raw data: assessing quality, cleansing, preprocessing, structuring for downstream processing.\nConduct research and development activities, data exploration and discovery using Data Science and Machine Learning (ML) practices.\nDevelop, apply, test and implement Data Science and ML models for a wide variety of datasets gathered from different data sources such as Online market places, e-commerce platforms, social media, and web sources.\nDesign and develop accurate and scalable ML models in different domains and applications, which include, but not limited to, Recommendation engines, Chatbots, NLP, text mining, text-based feature selection/representation, optimization and predictive modeling.\nUtilize a variety of tools and approaches to solve complex business objectives, from Recommendation Engines, Chatbots, Natural Language Processing (NLP), Machine Learning/ Deep Learning, Image Processing, Speech Processing, Rule-Based Learning and Knowledge Graphs.\nDesign new service offerings and solutions in E-Commerce and different fields.\nKeep up to date with latest trends and technologies in the data science and ML fields.\nWork closely with business analysts and product development teams to understand and implement their requirements.\nCollaborate with big data and software developers to translate ideas, models and prototypes into full-fledged solutions.\nWork closely with cross-functional teams to identify challenges and problems and suggest potential AI solutions.\nRequirements\nBachelor's degree in quantative field (Statistics, Mathematics, Computer Science, Engineering, etc.); graduate degree in Data Science or other quantitative field is preferred.\nAt least 2 - 4 years' of experience as a data scientist (quantitative analytics and data modeling).\nDeep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms.\nExperience in ML applications and domains (Recommendation Engines, NLP and Chatbots experience is preferred).\nExperience in Deep Learning algorithms and techniques.\nProficiency in Python (other languages such as Shell Scripts, C++, .Net, Java, Matlab, R,...etc are preferred).-\nExperience in Python libraries (Tensorflow, Keras, Pandas, Sklearn).\nExcellent in Algorithms and Object-Oriented programming.\nFamiliarity with database technology (design and implementation) and query language.\nFamiliarity with Big Data frameworks and visualization tools (ElasticSearch, Cassandra, Hadoop, Spark) is preferred.\nStrong organizational and project management skills.\nGood problem-solving skills.\nExcellent communication and presentation skills\nBenefits\nMedical Health Insurance\nPerformance Bonus\nOthers"}, {"link": "https://sa.indeed.com/rc/clk?jk=341a7df5a4122d11&fccid=36028905bb7e7da7&vjs=3", "location": "Jeddah", "title": "Data Scientist", "company": "Halian", "salary": NaN, "desc": "Our Client\nWe are partnered with one of the largest Technology organizations globally.\nOn their behalf we are looking for a Data Scientist to deliver one of their long-term projects with an end-customer in Jeddah.\nYour Responsibilities\nConnect people processes & outcomes with data, driving a data-first culture in marketing.\nTransform data into actionable insights for impactful decision making.\nDemocratize data science by advocating for use of AI/ML solutions and equip marketing for its future.\nEmpower explainable AI to build trust and confidence in decisions and actions.\nYour Qualifications\nBachelors/Masters/PhD degree in a quantitative discipline/technical field\n8-10 years experience leading and/or participating in data science/data analytics projects end to end\nProficiency in programming language (R/Python etc.) and database manipulation using SQL\nExperience with statistical data analysis and data science techniques; Data visualization and Data storytelling\nExperience in articulating and educating technical & complex processes to a variety of non-technical audiences, bridging between technical and business.\nExperience in end-to-end deployment of data science/ML applications\nDemonstrable experience with designing and simplifying complex processes and implementing them with a well-defined rhythm and rigor\nA keen understanding of technology business\nHalian Group\nWith over 20 years of experience, we have come to understand that innovation is the only way to provide agile, practical solutions that transform businesses and careers.\nOur resourcing and smart services help you to realize tomorrow’s potential. Discover the amazing things possible when you bring the right people and the right technologies together."}, {"link": "https://sa.indeed.com/rc/clk?jk=fb99a740b741d480&fccid=3ef35aed877c5463&vjs=3", "location": "Jeddah", "title": "Senior Construction Manager", "company": "Scientific Research Corporation", "salary": NaN, "desc": "The new construction of site improvements and several housing amenities, along with six security towers will take place on an existing, newly constructed U.S. Consulate post that will remain in operation during all phases of construction. The compound is approximately 60,000 square meters. Site improvements include a new Water Demarcation Building, sanitary sewer connection, pool shade canopy and pool heater system, parking canopy structure, and the renovation of the first floor of one multi-resident bldg. to add a play area, exercise room, and a new motor pool office. Six guard towers are to be constructed along the perimeter wall, and shall be standalone from the wall. The perimeter wall height shall be increased to the current requirement, and repairs to the wall and stucco coating are included.\nPRIMARY DUTIES & RESPONSIBILITIES:\nDevelops working knowledge of all technical requirements of project\nProvides Quality Assurance for ongoing construction project\nPrepares Monthly Progress Reports and attends meetings summarizing project status, with emphasis on engineering\nCoordinates the development of Independent Government Estimates (IGEs) for modifications and change orders\nPerforms a wide range of construction management functions, assisting the OBO Project Director (PD) as a Construction Manager (CM) and management expert for planning, directing, managing, and coordinating the Department's overseas construction projects\nWorks with assigned project team members to achieve the highest possible priority and effectiveness in meeting the scope, schedule and cost goals of the OBO Construction Management projects.\nPerforms tasks and assignments that include, but are not necessarily limited to, the following:\nWorks closely with the PD or OBO Construction Management Construction Executive in coordinating the efforts of the OBO project staff providing leadership and guidance to the OBO project staff\nEnsures that an appropriate safety and accident prevention plan is implemented on each project contract\nReviews, monitors and coordinates project safety issues with the Contractor, the Post Occupational Safety and Health Officer (POSHO), and the Safety Officer in CM's Construction Support Division (OBO/CFSM/CS), in accordance with the requirements of the US Corp of Engineers Safety and Health Requirements Manual and host country health and safety requirements when more stringent\nAssists post and/or manages the work of the OBO CM Project Contractor(s) in planning, coordinating, evaluating, and scheduling the work to ensure that Project Contractor(s) meet required standards of quality, civil schedule, cost goals, and contract compliance\nInterprets and explains plans and contract document terms to administrative staff, contractor superintendents, vendors, and OBO clients, representing the interests of OBO while ensuring the understanding of all that the Contracting Officer for the project contract is the only individual with authority to direct changes to the scope of work through written modifications.\nEnsures that the project contractor(s) have obtained any necessary licenses and permits and that they are properly displayed with a copy in the project files prior to commencement of related works\nEnsures project contractors provide appropriate supervision and quality control inspections of the work\nStudies the International Building Code and job specifications to determine appropriate construction methods providing quality assurance inspections and field verification of all aspects of the contractor's quality control program\nSupervises owner-sponsored field / laboratory tests as required to verify the contractor's quality control program\nConfers with supervisory personnel, Post clients, contractors, and design professionals to discuss and resolve matters such as work procedures, complaints, and construction problems\nReceives contractor submittals and reviews for completeness and determines whether OBO project staff, OBO Design Engineer, or the Architectural/Engineering (A/E) performing construction phase services shall review and provide comments and recommendations for acceptance of the submittals\nTracks the timeliness of submittals due from the contractor, their review by OBO, and response/return to the contractor\nEvaluates contractor's proposed submittal substitutions with construction engineering implications and makes recommendations to the PD concerning the disposition of the contractor's request\nEvaluates the necessity and accuracy of any contractor change order proposals; and prepare Statements of Work and Independent Government Estimates for modifications and change orders as may be required\nReviews and evaluates design calculations and data provided by the contractor(s) from a construction engineering perspective\nEnsures that the project contractors maintain as-built documentation;\nProvides the PD with draft responses to the contractor's and other organization's requests for information\nReviews the contractor's monthly pay request accurately represents the work performed by the Project Contractors\nEnsures that materials for which payment has been requested are properly accounted for, in acceptable condition, and stored correctly\nMaintains a \"Daily Project Log\" as defined in the Construction Management Guidebook\nPrepares a CM Monthly Progress Report summarizing the status of construction projects\nPublishes and distributes the CM Monthly Report as directed, maintaining progress photo albums for each contract project\nImplements and monitors project reporting in accordance with the Construction Management Guidebook\nAs required, assists the Project Director and/or Post in acquiring and utilizing local construction professionals and construction contractors\nEnsures scopes of services required of Local Employee Staff (LES) and local A/E firms are appropriately defined from an engineering standpoint\nSupports the PD in all contract administration matters, including negotiation of modifications and/or claims and interpretation of contract requirements\nDevelops and maintains an inventory of property to include domestic and overseas project property procured for the CM Projects, ensuring that inventory reporting complies with the requirements of the Department, the Foreign Affairs Manual (FAM), and directions promulgated by the Office of the Deputy Director for Resource Management (OBO/RM)\nAs required, assists with the development of presentations, special reports, and special projects as related to the engineering aspects of the overseas construction program;\nParticipates in project meetings and conferences as appropriate, and, when required, prepares minutes of project meetings\nCooperates and coordinates with the Contracting Officer Representative (COR) and other members of the CM and OBO staff\nUndertakes other duties, similar to those described above, as may be assigned by the COR\nRequirements:\nMINIMUM SKILLS & REQUIREMENTS:\nA Bachelor degree of above in engineering, architecture, or construction management degree from an accredited program and a minimum of seven (7) years of experience required on construction projects of similar scope and dollar value to the project supported by this Task Order\nDesign office experience shall not count toward an employee's experience\nA Professional Engineering License (PE) is acceptable in lieu of a degree\nOverseas experience is preferred\nMust have Final Secret, Interim Top Secret (TS), or Final TS security clearance issued by the Defense Counterintelligence and Security Agency (DCSA) at the time of consideration\nKnowledge of International Codes required\nExperience in assessing and responding to Requests for Information (RFI)\nExperience in reviewing and evaluating design calculations and data from an engineering perspectiv\nKnowledge of Construction Safety regulations, i.e. EM 385-1-1, OSHA, etc\nKnowledge of Microsoft Suite, i.e., PowerPoint, Excel, and Word required\nOther related duties as assigned by the Project Director\nSRC IS A CONTRACTOR FOR THE U.S. GOVERNMENT, THIS POSITION WILL REQUIRE U.S. CITIZENSHIP AS WELL AS, A U.S. GOVERNMENT SECURITY CLEARANCE AT THE SECRET LEVEL WITH TOP SECRET ELIGIBILITY\nWORK LOCATION: JEDDAH, SAUDI ARABIA\n\nPROJECT DURATION: 16 MONTHS WITH EXPECTED FOLLOW-ON WORK WITHIN THE DoS PROGRAM\nCOVID-19\nAll Federal contractor employees may still be required to be fully vaccinated for COVID-19, regardless of work location (including work from home), except for those employees that work only in foreign countries. Full vaccination status is achieved two weeks after the final vaccine dose. This requirement does permit employees to request reasonable accommodations for medical or seriously-held religious reasons.\nABOUT US\nScientific Research Corporation is an advanced information technology and engineering company that provides innovative products and services to government and private industry, as well as independent institutions. At the core of our capabilities is a seasoned team of highly skilled engineers and scientists with multidisciplinary backgrounds. This team is challenged daily to provide cutting edge technology solutions to our clients.\nScientific Research Corporation offers a competitive salary, an extensive benefits package and a work environment that encourages excellence. For positions requiring a security clearance, selected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\nDIVERSITY & INCLUSION\nWe strongly believe in the abundance of differences among individuals. We value different points of view and appreciate diverse perspectives. We truly believe this is what makes our organization inclusive and more responsive to the needs of our diverse customers.\nEQUAL OPPORTUNITY EMPLOYER\nScientific Research Corporation is an equal opportunity and affirmative action employer that does not discriminate in employment.\nAll qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, age, sexual orientation, gender identity, or national origin, disability or protected veteran status.\nScientific Research Corporation endeavors to make www.scires.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact srchr@scires.com for assistance. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications."}, {"link": "https://sa.indeed.com/rc/clk?jk=8c9f296de49be1a5&fccid=bafa4b35e9cd20ce&vjs=3", "location": "Jeddah", "title": "Senior Environmental scientist", "company": "AECOM", "salary": NaN, "desc": "As a KSA Intermediate Terrestrial Ecologist III, you will be a core member of both AECOM Arabia and the Middle East & Africa Environment Team. You will have a passion for environmental sciences, particularly ecology and field ecology. You will be inquisitive and enthusiastic about flora and fauna identification with a particular interest or focus on the Middle East / Saudi Arabia. You will be familiar with terrestrial flora and fauna field survey standards and protocols, their implementation and, where these do not exist yet, their development, and their undertaking over 1-day or multi-day field expeditions; as such, you will demonstrate an eagerness for travel, the outdoors, hiking / driving in rugged terrain and various weather conditions and show excitement for working field days closely with other team members. You will correlate the field methods and findings in your analysis with the client’s needs and policy or legislative requirements to produce technical reports, summarizing methods, findings, recommendations.\n\nThe key responsibilities afforded by this role are as follows:\n\n+ Managing the delivery of proposal and project outputs including – proposal technical and commercial inputs, field methods statements, policies / standards / protocols development where none exist, ecology technical reports document existing baseline conditions / field survey findings / recommendations.\n\n+ Developing and implementing field programmes based on client requirements and / or country/international standards.\n\n+ Undertaking field programmes to collect baseline / existing conditions data on terrestrial flora and fauna, habitat characterizations and assessment, identifying opportunities and constraints to development.\n\n+ Working in partnership with other members of the Riyadh Environment and the broader AECOM Arabia and Middle East teams.\n\n+ Prioritising tasks and meeting commitments on an on-going basis and taking ownership and responsibility for the completion and quality of work.\n\n+ Ensuring that health and safety issues are embedded in project delivery from the outset.\n\n+ Identifying opportunities to mentor team members and providing guidance and coaching.\n\n+ Fully qualified scientist. Utilizes scientific principles, theories, practices and existing technologies to develop technical solutions to a wide range of difficult problems.\n\n+ Requires general familiarity within a broad field of scientific knowledge of reciprocal effects of the work upon other disciplines/fields.\n\n+ Interprets and records data, conducts analyses, compares findings to relevant studies and local, state, and federal regulations to ensure compliance.\n\n+ Works under only general direction. Independently determines and develops approach to solutions.\n\n+ Solves problems by use of combinations of standard procedures, modifications of standard procedures or methods developed in previous assignments.\n\n+ Participates in planning required to achieve prescribed objectives.\n\n+ Conducts analysis and investigation work obtained from a variety of sources.\n\n+ Performs inspections and tests to ensure compliance.\n\n+ Participates in developing corrective measures and procedures. Formulates hypothesis, performs research and makes recommendation.\n\nSkills\n\n+ You’ll need to be self-motivated, enthusiastic and ambitious, as well as having:\n\n+ Terrestrial flora and fauna identification skills, particularly species of the Middle East / Saudi Arabia.\n\n+ Demonstrated ability to conduct field work over several days in outdoor conditions, either as part of a team or leading a team of field ecologists.\n\n+ Eagerness to work with teams comprised of diverse backgrounds and skillsets: opportunity-oriented mindset and attitude.\n\n+ Adaptability and flexibility in facing uncertainty or changes in plans: client- and solutions-oriented attitude.\n\n+ Familiarity with Saudi Arabia’s Environmental Regulations / Standards and experience in liaising with ministries/clients (such as MEWA, Royal Commission for Jubail and Yanbu, ARAMCO, NEOM, NCEC, PIF, GAMEP, etc.).\n\n+ The ability to lead and work collaboratively as part of an established team, supervising members of staff as applicable.\n\n+ Excellent verbal and report writing skills, including technical reviewing – all with an attention to detail.\n\n+ Ability to work to deadlines and budget constraints, working flexibly under pressure and responding to changing project and programme demands.\n\n+ Strong organisational skills, attention to detail and the ability to structure and prioritise the delivery of project outputs effectively while working as part of a multi-disciplinary team.\n\n+ Willingness to travel.\n\nMinimum Requirements\n\n+ Minimum 8 years’ working experience.\n\n+ Valid full drivers’ licence.\n\nPreferred Qualifications\n\n+ Graduate and/or post-graduate degree in relevant ecology and/or environmental disciplines.\n\nWhat We Offer\n\nWe will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n\nYou will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n\nWe will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.\n\nWe offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.\n\nWhen you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.\n\nAs an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours."}, {"link": "https://sa.indeed.com/rc/clk?jk=2abff331d6390638&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Secretary", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Administration/Secretarial\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 21, 2022\nUnposting Date\n: Oct 20, 2022\nReporting Manager Title : Administration Department Lead\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nResponsibilities:\nProvide the relevant group or team with administrative and clerical support when required\nPrepare and distribute incoming and outgoing correspondence\nProgram and file documentation and set up and maintain group filing\nMonitor and, when required, purchase stationary and other office supplies\nAssist with a range of administrative activities including; i. Preparation of expense reports ii. Processing of purchase orders/invoices\nArrange meetings, including organising equipment requirements, ordering of food and beverages and clearing up meeting rooms at completion of meetings.\nArrange and make travel and accommodation arrangements\nSupport the administration teams of other groups when required\nAssist with the creation and preparation of correspondence for internal and external clients, documents, presentations and/or publications\nProvide customer service and ensure that information provided to clients is accurate, timely and in accordance with policy and procedure\n\nQualifications - Internal\nPersonnel\nPro-active, goal oriented with excellent attention to detail.\nExcellent customer focus and able to consistently meet WorleyParsons and its clients needs.\nEffectively manages change to work tasks and the work environment, and assists others with adapting to change.\nA person of integrity who is trusted by others and consistently honours their commitments.\nAble to identify issues, problems and opportunities; make timely decisions; develop appropriate and innovative solutions; and ask for assistance if required.\nExcellent verbal and written communications skills, including the ability to convey information and ideas to individuals and groups, and make presentations when required.\nDemonstrates initiative and a willingness to learn and continuously improve on performance.\nAble to work on multiple projects of various size and complexity.\nAble to work effectively in small to large multi-disciplinary teams, and share and transfer knowledge within teams.\n\nExperience\nExperience in the relevant discipline in the same or similar industry, including previous administrative experience\n\n• Relevant degree or qualifications, accreditation or training including Secretarial or Office Administration qualifications.\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\n\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=6324c7847644c49e&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Project Engineer", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Project Engineering\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 15, 2022\nUnposting Date\n: Oct 14, 2022\nReporting Manager Title : Project Director\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nPurpose\nManage and coordinate multidiscipline engineering activities to ensure projects are executed in a safe, efficient, cost effective and timely manner.\nAct as primary technical co-ordination interface with client to ensure that the client's expectations are satisfied.\nEnsure the project conforms to the client's approved Basis of Design and all applicable regulatory and code requirements.\nResponsibilities\n\nHSE Management\nVisibly support Worley One-Way Program and maintain HSE focus within the team to ensure OHSE requirements included in design and procurement.\nClient Relationships\nEstablish, maintain and build healthy client relationships and resolve project issues as required with the client.\nProactively resolve performance, scope and schedule issues with the Client as they arise.\nEffectively manage assigned budgets within Worley' total scope.\nScope Management\nEnsure compliance with WPMP.\nEnsure compliance with requirements of the contract.\nApply effective change control process.\nCost Control\nMonitor cost aspects of the project within direct control and forecast final costs, identify trends and take action to avoid cost overruns.\nQuality Management\nContribute to supporting and complying with Worley policies, procedures and guidelines.\nTeam Management\nFocus the relevant team members on achievement of milestones and other key project objectives.\nCommunications Management\nEffective communication with the design team and third parties.\nAccurate, timely and effective reporting to the Project Manager.\nRisk Management\nMonitor the closure of all identified risks in the risk register and proactively search for other areas in the project which may be a risk in the future.\nDesign Management\nSet clear objectives to the design team and manages inter-discipline interfaces effectively.\nEnsure the design team aware of, and complies with, client's requirements and applicable regulations and codes.\nProcurement/Subcontracts Management\nAssist as required the procurement processes throughout the project to ensure goods meet specification, are delivered on time and are within budget.\n\nA recognised engineering degree in the relevant discipline or equivalent.\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=6ea1fa9714d75835&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Project Administrator", "company": "Worley", "salary": NaN, "desc": "48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com"}, {"link": "https://sa.indeed.com/rc/clk?jk=ec60ec1abf9a8924&fccid=6576e7250aa78c3c&vjs=3", "location": "Riyadh", "title": "Senior/Lead Data Scientist - QuantumBlack, AI by McKinsey", "company": "McKinsey & Company", "salary": NaN, "desc": "Who You'll Work With\nYou will be based in our Riyadh, Saudi Arabia office as part of our QuantumBlack, AI by McKinsey team, partnering with consultants, clients and other colleagues.\nOur QuantumBlack, AI by McKinsey teams bring the latest analytical techniques plus a deep understanding of industry dynamics and corporate functions to help clients create the most value from data.\nWhat You'll Do\nYou will use data creatively to solve business challenges, often uncovering new and transformative opportunities along the way.\nIn this role, you will focus on the development of advanced analytics models to optimize underlying business problems. You will apply state-of-the-art advanced analytics, quantitative tools and modeling techniques to interpret, make inferences and offer recommendations based on insights from the data.\nYou will shape the future of what data-driven organizations look like, drive processes for extracting and using that data in creative ways and create new lines of thinking within an infinite number of clients and situations.\nYou will create valuable, transformative business strategies through the measurement, manipulation, reporting and dissemination of broad sets of data. You will apply and advise on state-of-the-art advanced analytic and quantitative tools and modeling techniques in order to derive business insights, solve complex business problems and improve decisions. You will review, support and advise on the day-to-day analytics requirements of clients’ key operational processes while continually improving the impact of these processes.\nQualifications\nUndergraduate degree in mathematics, statistics, physics, engineering; master's degree is a plus\n4-7 years of professional experience in programming; experience applied to business problems is a plus\nExperience in programming (focus on machine learning) in Python; knowledge in SPSS, SAS, Ruby, Hadoop is a plus\nExperience in data treatment/data mining: SQL, AWK, Access, Spark, Excel\nDemonstrated aptitude for analytics; statistical knowledge is a plus\nProven record of leadership in a work setting and/or through extracurricular activities\nAbility to work collaboratively in a team environment and effectively with people at all levels in an organization\nAbility to communicate complex ideas effectively, both verbally and in writing, in English; fluency in local office language(s) is a plus"}, {"link": "https://sa.indeed.com/rc/clk?jk=7eab21c6e4d5b56d&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Junior Geologist", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Geomatics\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Graduate\nJob Posting\n: Aug 22, 2022\nUnposting Date\n: Oct 21, 2022\nReporting Manager Title : Project Director\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nWorley is currently looking for a Juniior Geologist to be part of our team on a project in Kingdom of Saudi Arabia.\nDuties and Responsibilities:\nFamiliar with MSOffice software\nExperience reading maps, using a GPS, and driving off-road is preferred\nAbility to walk up, down, and over rough terrain with the ability to lift and carry up to 50 lbs. throughout the day\nAbility to work in adverse weather conditions\nPerform data entry and regularly update client and employer with data\nConsider and manage the cultural heritage, community relations and environmental implications of exploration activities\nMinimise the company risk exposure and liabilities by monitoring activities to ensure compliance with all statutory, regulatory, and licensing obligations including the respective\nAbility to operate with sensitivity and perception across multiple stakeholders\nExcellent communication skills (verbal & written)\nWill be actively involved in program management, data interpretation, and monitoring of field mapping, program, logging core and drill design.\nSupervision of any sample collection, storage, shipment performed by technicians\nComplete field visits to drill sits to check drill site locations and ensure drill and exploration programs are conducted to high standards and samples are collected and transported to the assay lab efficiently\nDirects and coordinates employees assigned with consistent Company policies, procedures and standards.\nBachelor Level degree in Geology\n\n0-5 years experience\n\nValid Drivers license\n\nArabic Speaking\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=903096cd871aac3d&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Contracts Specialist", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Corporate Procurement\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 24, 2022\nUnposting Date\n: Oct 24, 2022\nReporting Manager Title : Project Contract Manager\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nDuties and Responsibilities:\nExcellent understanding & extensive experience of the procurement and contract administration processes and principles from preparation and issue of Bidders Lists, Contracting Plans and bid invitation package preparation through to award, administration and close out of Contracts;\nStrong grasp of procedural requirements & necessity of providing an Audit Trail for Management purposes; and\nManages, provides advice on and administers all activities concerned with contracts for works and services associated with oil and gas facilities projects carried out under various contract forms and modes of reimbursement.\nResponsible for pre – award activities including bid invitation preparation, processing queries from bidders, preparation of bid evaluation programmes, evaluation of bids, negotiation, contract preparation and award formalities;\nResponsible for post – award activities including conducting kick – off meetings, coordinating all contract submittals and correspondence, preparation and processing of variation orders, claims and close out;\nManages the drafting of Invitation to Tender packages for contracts for large O&G facilities projects. Review and, if necessary, proposes comments on and propose alternative text/clauses to client contract conditions;\nReviews issues with legal, risk management, tax, and accounting personnel as a condition precedent to submitting to management for approval;\nFunctions as a part of a negotiating team consisting of project management staff, to establish the terms and conditions of a contract;\nMonitors and ensures the business provisions of assigned contracts are administered to ensure compliance with contractual terms and conditions. Keeps the Projects Contracts Manager advised as to the scope, financial, and risk features of applicable contracts;\nEnsures documentation to negotiate change orders are properly produced and maintained;\nPrepares letters to clients requesting approvals and interpretations necessary to comply with the provisions of the contract;\nEnsure project/facility acceptance documents are prepared and are followed through and that acceptances are signed by the client;\nFurnishes business and financial information requested by the client concerning the project, as delegated by the Project Manager;\nIdentifies contractual problems and take appropriate action to ensure a satisfactory resolution. Follows up on those problems which demand management attention, to ensure timely response to the client; and\nManagement of Contract Quality standards.\nB.Sc. in any engineering discipline or equivalent College degree or equivalent experience\n4 years industry experience\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\n\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=92150a3022462878&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Cost Controller", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Project Controls\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Sep 19, 2022\nUnposting Date\n: Nov 18, 2022\nReporting Manager Title : Senior Project Control Manager\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nonitor Labour and Non-Labour Costs during project execution.\nProvide Cost data into project controls system and issue weekly reports on project cost status vs budget.\nTake ownership of the cost control function and ensure integrity of the data being processes\nSupervise any supporting roles in the project cost control area\nDevelop, implement and control the project accounting and job costing system to meet project requirements\nPrepare regular status reports and forecasts for project management and client review.\nPrepare inputs for project Invoices.\nPreparation of monthly financial reports for the project. Also prepare other financial analysis as required on an adhoc basis\nPreparation of budgets in conjunction with engineering and construction team members\nQuality Assurance – Responsible for working within the provisions and guidelines of the Quality Assurance system.\nSafety – Responsible for personal safety safe working practices for the Project.\n\nMinimum 5 years relevant industry cost control experience.\nChartered Accountant or CPA, or Engineering Degree or relevant years experience.\nMust be proficient in cost management softwares.\nGood interpersonal, organizational, analytical and communication skills.\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\n\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=65cc4aeb7bde7e6b&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Manager II, Document Control", "company": "Worley", "salary": NaN, "desc": "48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com"}, {"link": "https://sa.indeed.com/rc/clk?jk=f7674aaeb32dd711&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Buyer", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Project Procurement Management\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 23, 2022\nUnposting Date\n: Oct 22, 2022\nReporting Manager Title : Supply Chain Manager\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nWorley is currently looking for an experienced Buyer to be part of our team on a project in Kingdom of Saudi Arabia.\nDuties and Responsibilities:\nProvides all project procurement activities as required by Project and also ensures the proper coordination with other project disciplines to meet all procurement milestone dates.\nAssists development of Project Procurement Plan and Strategy\nManages/ Conducts Suppliers (Vendors) Pre-Qualification Process\nPrepares RFQ packages / RFQ bidder lists\nIssues RFQ, collect Bids\nPrepares commercial bid evaluations\nNegotiates / Clarifies commercial matters with Bidders\nPrepares Approval forms for PO placement\nIssues POs\nAdministrates POs\nExpedites all deliverables defined in POs including delivery of the ordered equipment/ materials / services\nCoordinates inspection / logistics matters with relevant parties\nObtains / Assesses Suppliers (Vendors)’ Progress Report\nObtains invoices and Assess invoices for payments\nPrepares / Updates Procurement Reports such as PSR/ESR/LSR\nAssesses / Evaluates Suppliers(Vendors)’ Performance\nPerforms POs close-out\nMust have:\nBachelor’s Degree or higher, in Engineering or Business Management\n+5 Year Experience of EPC or EPCM Contract and Project Procurement\nThorough knowledge of project procurement process, practices & commercial terms and conditions, IK/OOK market & suppliers, logistics, international codes and standards.\nStrong skills of commercial awareness, negotiation, internal/external communication, presentation & reporting and MS (word/excel/power point/teams, etc.)\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\n\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=ca0f12991b6ec9c4&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Risk Engineer", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Project Risk\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Sep 6, 2022\nUnposting Date\n: Nov 5, 2022\nReporting Manager Title : quality Manager\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nDuties and Responsibilities:\nImplementation of, the Worley's Risk Management Policy and Framework and OneWay Element 2- Risk Management\nDevelopment of a risk execution plan (or Risk Management Plan) that aligns with the Client’s and Worley's requirements for qualitative risk\nDevelopment, maintenance and implementation of the Project Risk Schedule\nDevelopment, maintenance and implementation of all project Risk Management procedures\nDetermining or developing the appropriate tools / software to support the project’s risk management program\nFacilitation of risk workshops, reviews and discussion\nFollowing up with action owners to drive action implementation through proactive monitoring and communication with relevant key risk management stakeholder\nEnsuring that risks recorded and identified in the Project Risk Register ashaving ineffective treatment plans are further investigated by the project team to determine additional risk treatments that will reduce the risk to an acceptable level\nConduct risk management activities for the projects\nEnsuring that once the treatment has been completed that the status of the risk is updated in the Project Risk Register. This is carried out in conjunction with the person responsible for actioning any treatments and the Project Manager\nWorking with various Project teams to discuss risk issues specific to their scope of work to ensure work is conducted in accordance with the Risk Management Plan\nWorking with contractors to identify risks and implement management plans\nReviewing Risk Registers current controls for effectiveness and where necessary working with Quality Assurance (QA) to validate effectiveness\nEscalation of risk related issues as required\nFamiliarity with quality control systems\nMust have thorough knowledge of engineering practices and economic principles, calculation methods, design details, international codes and standards, procedures, and specifications.\n\n\nBachelor's degree in Engineering,Accounting, Business Administration or related field.\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\n\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=faa6b1a0b9ca7359&fccid=6576e7250aa78c3c&vjs=3", "location": "Riyadh", "title": "Lead Data Engineer - QuantumBlack, AI by McKinsey", "company": "McKinsey & Company", "salary": NaN, "desc": "Who You'll Work With\nYou will be based in our Cairo, Egypt, or Riyadh, Saudi Arabia, office as part of our QuantumBlack, AI by McKinsey team, partnering with consultants, clients, and other colleagues.\nOur QuantumBlack, AI by McKinsey teams bring the latest analytical techniques plus a deep understanding of industry dynamics and corporate functions to help clients create the most value from data.\nWhat You'll Do\nYou will find opportunities in data by using established tools and techniques, or by innovating/building new ones.\nIn this role, you will collaborate with consultants and data-scientist to design and drive architecture and implementation planning for our clients and act as a big data evangelist, educating McKinsey's and client's teams on data engineering topics. You’ll actively cooperate with data scientists and digital consultants to incorporate clients’ requirements and impactful analysis into our data products. You’ll advise relevant people at the firm on technical aspects of analytics engagements.\nThis is a hybrid client-facing/technical role using state-of-the-art technologies, whilst also being able to communicate complex intractable ideas to non-technical audiences.\nQualifications\nBachelor's degree in computer science, engineering, mathematics or another relevant subject\n5+ years of experience in big data related software development\nExperience with data modeling, design patterns and building highly scalable and secured solutions\nA background in development with practical experience with at least one general purpose programming languages (i.e. Python, R, C, Java, Scala, etc.)\nFamiliar with big data platforms like SQL, Teradata, Hadoop, Spark\nExperience preparing data for analytics and following a data science workflow\nAdvanced knowledge of data structures and algorithms, networking, operating systems and foundational experience standard unix/linux operating systems, version control and DevSecOps tool chains etc\nAbility to work with a myriad of data types (i.e. structured and unstructured), extracting information from modern and legacy data platforms and identify and perform linkages across disparate data sets\nMeaningful experience in extracting and loading data from multiple database technologies like RDBMS (MS SQL Server, Oracle, MySQL, PostgreSQL), MPP (AWS Redshift, Teradata, Snowflake) and optionally NoSQL (MongoDB, DynamoDB, Cassandra, Neo4J, Titan)\nExperience and interest in Cloud platforms such as AWS, Azure, GCP\nCommercial client-facing project experience is helpful\nProven record of leadership in a work setting and/or through extracurricular activities\nAbility to work collaboratively in a team environment and effectively with people at all levels in an organization\nAbility to communicate complex ideas effectively, both verbally and in writing, in English; fluency in local office language(s) is a plus"}, {"link": "https://sa.indeed.com/rc/clk?jk=9fdbe14721a46181&fccid=bafa4b35e9cd20ce&vjs=3", "location": "Riyadh", "title": "Senior Advisor, HR Operation", "company": "AECOM", "salary": NaN, "desc": "AECOM is currently seeking to hire an experienced Senior Advisor, HR Operation for a permanent opportunity to work with our HR function.\n\nJob Role & Responsibilities:\n+ Support HR Operations services such as On-boarding, Off-boarding, employee life cycle and ensure Central Services/Infrastructure, structures, processes and systems are aligned to deliver key objectives efficiently and effectively.\n\n+ Understanding of the assets HR policy & HR matrix deliverables for the assets.\n\n+ Follow all relevant HR policies, processes, standard operating procedures, and instructions so that work is carried out in a controlled and consistent effective manner for the asset.\n\n+ Prepare employee-related records/reports and ensure the information available on the system is always accurate.\n\n+ Modify & amend any changes in employee forms, introduce new forms in order to facilitate smooth operations and ease of administration.\n\n+ Advice on employee records – leave analysis, service analysis, information on loans, financials, etc.\n\n+ Implements the hiring process and submits all relevant documentation to proper local authorities, as required by local labor law.\n\n+ Implements the termination process (voluntary leave, dismissal, retirement, end of contracts etc.) and submits all relevant documentation to proper local authorities.\n\n+ Maintains personnel files and updates their records.\n\n+ Monitors personnel leave and updates the Leaves database.\n\n+ Monitors employees' payroll related data (hiring, termination, sickness, maternity leave, unpaid leave, tax withholding, insurance contribution etc.) and submits the annual and monthly employer’s obligations to local authorities.\n\n+ Acts as the contact point for employees’ requests regarding their rights and obligations.\n\n+ Monitors Collective Employment Agreements to secure the minimum remuneration requirements are exceeded where applicable.\n\n+ Co-operates with payroll team and prepares reports based on ongoing and ad-hoc requests.\n\n+ Excellent knowledge of labor law.\n\nMinimum Requirements\n\nMinimum of 4 years of applicable experience managing HR operations function.\n\nPreferred Qualifications\n\n+ An advanced bachelor’s degree in Business, Human Resources, Organization Development or other related field is required; advanced degree and PHR/SPHR preferred.\n\n+ Able to train new joiners in the team.\n\n+ MS Excel knowledge and experience in preparing reports, PowerPoint presentations, etc.\n\n+ Excellent communication skills.\n\n+ Experience in end-to-end HR operations, Knowledge Transfer, Workforce Administration, Transition management, Payroll Management, hire to retire, etc.\n\n+ Ability to coach and mentor peers, team members, and key stakeholders.\n\n+ Good knowledge of HR operational processes and understanding of local labor laws and legislation.\n\n+ An agile mindset to adapt to organization changes and stakeholders’ needs in a fast-paced environment.\n\n+ Ability to work independently and be proactive and meticulous.\n\n+ A collaborative and client-centric mindset, good work ethics and ability to partner and interact confidently with employees and senior stakeholders.\n\nWhat We Offer\n\nWe will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. You will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. We will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business. We offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career. When you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours."}, {"link": "https://sa.indeed.com/rc/clk?jk=122fa4da5904e136&fccid=2973259ddc967948&vjs=3", "location": "Riyadh", "title": "R&D Engineer (Contractor)", "company": "PepsiCo", "salary": NaN, "desc": "Responsibilities\n\nPepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $79 billion in net revenue in 2021, driven by a complementary beverage and convenient foods portfolio that includes Lay’s, Doritos, Cheetos, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, and SodaStream. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including many iconic brands that generate more than $1 billion each in estimated annual retail sales.\n\nGuiding PepsiCo is our vision to Be the Global Leader in Beverages and Convenient Foods by Winning with PepsiCo Positive (pep+). pep+ is our strategic end-to-end transformation that puts sustainability and human capital at the center of how we will create value and growth by operating within planetary boundaries and inspiring positive change for planet and people. For more information, visit www.pepsico.com .\n\nMain Purpose:\nAs a R&D Asst Scientist / Eng., working within MENA-PAK R&D, this position will support CAST, product development activities and technical brands stewardship agenda of Non-PC platforms of ME BU. This position report directly to R&D Sr. Product Development manager based in Riyadh.\n\nKey Accountabilities:\nSupport Sr. Product Development Manager in developing product prototypes against consumer and business KPIs by leveraging available resources including R&D Laboratory tools, bench top factory equipment, pilot plants, supplier’s technical assets.\nCoordinate samples requirements with manufacturing plants, global R&D function etc. for NPD, internal screening, bench taste, sensory test, consumer test, shelf life stability, mkt & sales samples and other needs.\nCoordinate product development activities and engage with BU GP and SC /OPS teams to run plant trials.\nUse experimental design data interpretation tools to make technically sound recommendations of key quality KPI,s to business.\nSupport to deliver Productivity, Sustainability, Brand Stewardship agendas of Non-PC platforms and engage with BU GP & SC /OPS teams to manage technical aspects.\nSupport in developing FC, business P&L and finalize product and ingredient specifications with SRA, Quality and Food Safety guardrails.\nUnderstand the PepsiCo Global Ingredient Standard and Supplier Standard, and become proficient in the PepsiCo Quality Program (PQP) and IT Applications associated.\nUse PEP Digital platforms / IT tools and lead PV/PQQ and SAP/SQ to create innovation specification and ensure timely completion of all its deliverables and approvals by R&D functional approvers (Regulatory, Quality, Food Safety & Product Development).\nWork with and provide guidance to supplier in completing the requirements of the specification through the completion of relevant tools i.e. Pre-Qualification Questionnaire(PQQ) in the following key areas:\nIngredient Composition\nAll Chemical, physical and other parameter requirement.\nClaims/Compliance related with QA/FS\nFood safety Requirements\nAllergen\nTest method and limit for FS and Performance parameters\nIngredient Micro sensitive assessment.\nOther Spec General information\nWork with Operation QC and Functional approver to review and align the specification changes. Communicate with vendors for acceptance on specification change as needed.\nLead exploration of new ingredients, formulation and process technologies and leverage expertise inside and outside the organization to deliver new product and process development.\nRepresent R&D on multi-functional business teams and Influence others through strong communication & interpersonal skills.\nProvide regular progress updates against agreed deliverables & objectives and timely communication of issues to Sr. Product Development Manager.\nSupport Sr. Product Development Manager in executing the new product launch flawlessly through the use of sound project management principles and the application of strategic decision-making tools.\nSupport Sr. Product Development Manager to deliver Reframe & Breakthrough innovations through participation in trials, commissioning and launch.\n#Locations: Riyadh, Saudi Arabia\n\nQualifications\n\nKey Skills/Experience:\nBachelor’s degree in Food Engineering, Food Safety, Food Technology, Food Science, Science, and Microbiology, or adjacent subjects. MS is desired.\n2-3 years of experience on Regulatory, QA/QC, Food Analytical experience, product development and or other Food related FMCG in a technical role.\nWell-versed on Microsoft Office and Excel.\nEffective communication skills, both verbal (i.e. presentation, conference calls) and written (i.e. reports, e-mails) in English.\nConfident and able to speak or present to senior leaders when needed.\nLearning agility, self-motivation and desire for continuous self-improvement.\nTeam player and works well with cross-functional, cross-regional and cross-cultural teams.\nCan work independently and has initiative for problem solving."}, {"link": "https://sa.indeed.com/rc/clk?jk=9a488cd42105d4d7&fccid=bafa4b35e9cd20ce&vjs=3", "location": "Riyadh", "title": "Document Control Supervisor -PMC", "company": "AECOM", "salary": NaN, "desc": "Works under general supervision.\nParticipates with other team members to achieve common goals.\nTroubleshoots problems of low complexity and recommends appropriate action.\nEffectively contributes to team goals.\nProject size is of low complexity\nProvides document management and project controls support which includes the receipt, inventory, audit, tracking, storage, retrieval and distribution of both classified and unclassified electronic, paper and other media project data and documents according to company policy, and proper procedures for the projects.\nManages the set up and maintenance of document control / records management for multiple projects and Project Managers.\nEnsures that all local practices and activities comply with company policies and procedures.\nMinimum Requirements\n\nTBC\n\nPreferred Qualifications\n\nTBC\n\nWhat We Offer\n\nWe will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n\nYou will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n\nWe will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.\n\nWe offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.\n\nWhen you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.\n\nAs an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours."}, {"link": "https://sa.indeed.com/rc/clk?jk=b6cd122a413e7696&fccid=c35071080615eaef&vjs=3", "location": "Riyadh", "title": "Clinical Operations Lead, MENA, Saudi Arabia", "company": "Huma", "salary": NaN, "desc": "Giving the world more time.\n\nFor the first time in human history we have the technology, data, and insights to redefine health. Together with our partners, we will make the leap from reactive to proactive medicine. By collectively benefiting from the data we individually generate, we can all live our longest, fullest lives. Huma partners with scientists, technologists, healthcare, and pharma professionals to understand, treat, and ultimately prevent ill health. Giving knowledge and power to those with medical conditions, while saving clinicians time, energy, and valuable resources.\n\nThe core mission of the Clinical Operations Lead’s role is to support the design, deployment and evaluation process of the digital health products implemented by Huma in the Middle East and North Africa (MENA). Jointly with the HUMA Commercial team and HUMA partners, you will be the clinical interface of HUMA to the MENA region’s KOLs and the medical community.\n\nWe are looking for a self-starting Clinician who wants to join a team of creative, proactive, and driven professionals at the cutting edge of digital medicine. Applicants should feel comfortable in meeting with clinicians, leading engagements and helping transform healthcare practices.\nYour mission\nHelp design, fine tune and improve digital health solutions implemented by HUMA customers in the MENA region\nBuild strong relationships with key stakeholders across healthcare, life sciences and other industries in the MENA region\nPromote and scale Huma’s Remote Patient Monitoring solution across the region’s hospitals\nEvangelize KOLs and hospital clinicians on HUMA’s digital solution in a variety of domains\nAdopt a “white glove” account management capability ensuring that our partners get the best from our product and have their concerns addressed in a timely and effective manner\nConfidently manage relationships with clinical and operational leaders in the healthcare systems\nBe the bridge between the clinical, commercial, product and engineering parts of the business\nWrite client-facing documents explaining project plans including memos and slide decks\nFrom day one in this role, we’ll expect you to have\nDegree in Medicine (MD/Dr. med)\n7+ years experience in a healthcare role (clinical, industry, strategy consulting, government or hospitals)\nExperience in project scoping, management and delivery\nExperience in digital health or life sciences preferred\nHighly analytical with the ability to back this up with critical thinking\nIt’s great, but not required, if you have\nA second degree in business administration, project management or public health\nExperience in client-facing professional services role\nExperience in remote patient monitoring solution\nExperience in digital health in general\nYou will thrive at Huma if you are\nAn Industry Expert - well networked, you used your knowledge and contacts to teach best practices\nA product evangelist who naturally engages others\nA self-solver - you are resourceful and seek solutions through collaboration\nAn agile thinker - comfortable adjusting to a ﬂuid business environment where rapid change is the norm\nA collaborator - you achieve some of the greatest results by working together\nDetail oriented - working with people’s health means we obsess over every detail and make sure we get it right\nSense of urgency - to be able to focus your energy on where it matters the most\nWhat we can offer you\nPrivate medical cover\nPaid vacation days + public holidays, in accordance with the Saudi practices\nEnd of Service Indemnity, in accordance with the Saudi laws\nEnd of Year Bonus, based on company and individual performance\nGenerous share options - every employee is an owner\nHome office allowance to support home working\nFamily first culture - giving the flexibility you need\nGrowth & development opportunities\nCome join us!\n\nWe believe magic happens when you bring together diverse ideas, experiences, and styles. We want to create a world where people live longer, fuller lives, and to do that well we need a team that represents all of the people and communities who use our solutions. We aspire to create an environment where everyone has the opportunity to do their best work. We are always looking for ways to improve so if you have any suggestions, please get in touch.\n\nDear recruitment agency friends: Huma attracts an amazing number of direct candidates and we do not need any help at this stage, so please do not send us unsolicited agency resumes. This is not a great use of your time, and we will not accept any liability or fees for any resumes or candidates which we have not asked you to find for us."}, {"link": "https://sa.indeed.com/rc/clk?jk=009602eba71a2497&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Senior Geologist", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Geomatics\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 20, 2022\nUnposting Date\n: Oct 20, 2022\nReporting Manager Title : Project Director\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nWorley is currently looking for an experienced Senior Geologist to be part of our team on a project in Kingdom of Saudi Arabia.\nMust have managed both diamond drill or reverse circulation exploration programs, totaling at least 50,000 metres. Must have managed multi-rig exploration programs, and large scale geological and prospecting programs. Must be very familiar with JORC standards, preferably as an author or co-author of these reports. Must be very familiar with resource estimation procedures, with a clear understanding of QAQC procedures as they impact these work types. Uranium experience is a prerequisite in one of the major geologic types—sediment, unconformity, or volcanic/intrusive hosted.\nFamiliar with all MSOffice software\nFamiliar with industry standard geological logging software, large databases, and drill hole presentation software\nExcellent presentation skills\nExperience using and/or interpreting various types of geological data in a GIS (ArcGIS or Map Info) platform for exploration applications;\nExperience reading maps, using a GPS, and driving off-road is preferred\nAbility to walk up, down, and over rough terrain with the ability to lift and carry up to 50 lbs. throughout the day\nAbility to work in adverse weather conditions\nPerform data entry and regularly update client and employer with data\nLiaise with the contractor as Managements’ representative concerning the interpretation of geological, geochemical and assay data to produce high quality 3D geological models for resource estimation\nConsider and manage the cultural heritage, community relations and environmental implications of exploration activities\nMinimise the company risk exposure and liabilities by monitoring activities to ensure compliance with all statutory, regulatory, and licensing obligations including the respective\nAbility to operate with sensitivity and perception across multiple stakeholders\nExcellent communication skills (verbal & written)\nWill be actively involved in program management, data interpretation, and monitoring of field mapping, program, logging core and drill design.\nSupervision of any sample collection, storage, shipment performed by technicians\nTrack mapping and drilling progress on daily and or weekly basis.\nUtilize industry-standard software to compile and interpret 3-D location, geologic & assay results. Assist with timely plotting of data\nInform supervisor of new assay results, geologic opinions/suspicions, etc.\nAssisting in assuring the quality control and quality assurance of samples;\nMonitoring and evaluating geological and assay data quality;\nEnsuring geological data is collected to specified standards and QA/QC protocol is followed and drill logs are error free and validated;\nComplete field visits to drill sits to check drill site locations and ensure drill and exploration programs are conducted to high standards and samples are collected and transported to the assay lab efficiently;\nDirects and coordinates employees assigned with consistent Company policies, procedures and standards;\nAt least a Bachelor Level degree in Geology\nFifteen years experience in the mining industry in progressive levels of experience. While exposure to mining geology is an advantage, the most relevant experience will be exploration related.\nValid Drivers license\nArabic language skills would be a definite asset\n\nArabic Speaking\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=2c4d6cc1ac41b2b3&fccid=16a37eddfee06e0f&vjs=3", "location": "Riyadh", "title": "SRE Manager, Cloud Platform", "company": "Lucid Motors", "salary": NaN, "desc": "Leading the future in luxury electric and mobility\nAt Lucid, we set out to introduce the most captivating, luxury electric vehicles that elevate the human experience and transcend the perceived limitations of space, performance, and intelligence. Vehicles that are intuitive, liberating, and designed for the future of mobility.\nWe plan to lead in this new era of luxury electric by returning to the fundamentals of great design – where every decision we make is in service of the individual and environment. Because when you are no longer bound by convention, you are free to define your own experience.\nCome work alongside some of the most accomplished minds in the industry. Beyond providing competitive salaries, we’re providing a community for innovators who want to make an immediate and significant impact. If you are driven to create a better, more sustainable future, then this is the right place for you.\n\nThe Cloud Platform team at Lucid is currently seeking a Site Reliability Engineering Manager. In this position, the individual will be involved in managing a team that will be responsible for providing reliability to the Cloud Platform that enabled Lucid Motors' Cloud-based Applications on various public and private Cloud Infrastructure.\nOur ideal candidate exhibits a can-do attitude and approaches his or her work with vigor and determination. We are looking for a hands-on Software Engineering Manager, who will collaborate with internal stakeholders to work on the backend to build automation to provision and maintain the Cloud Platform.\nResponsibilities\nManage and lead the Reliability Engineering of one or more cloud services across Lucid Motors at KSA.\nCollaborate with Service Owners to define the SLOs and build SLIs to ensure systems are meeting the SLAs.\nIndulge with Developers, DevOps, Data Scientists, and Quality Engineers right from design to production to build reliable services.\nBuild tools and frameworks to automate the monitoring systems to ensure the highest level of uptime in various production-grade environments.\nManage the reliability aspects of HA big-data systems and can identify the bottlenecks at the early stages.\nManage systems that use MQTT, Message brokers for Pub-Sub, Streaming Platforms such as Kafka, Data Analytics using Spark, No-SQL databases such as Elastic Search, Influx, Mongo, Presto, Cassandra, and other open sources services.\nManage the device to cloud connectivity and troubleshoot from end to end on a private or public cloud Infrastructure.\nDeploy and maintain Services that will be globally launched - on both Public Cloud Infrastructure providers and on-prem setup - and manage the uptime and reliability.\nOptimize Incident management processes and improve operational efficiency.\nBased on the customer impact, prioritizes the workload between features development and customer support.\nCreate a 24/7 service availability model to proactive monitor the systems to keep up with SLAs.\nParticipate in agile and scrum best practices and strive for continuous integration and delivery (CI-CD).\nWork with Product Owners and other team members from requirements gathering to developing a cloud platform that can launch services with a single click.\nTake appropriate actions by doing impact analysis during the incidents.\nHiring and building SRE organization from the ground up.\nRequirements\nB.S. or M.S. degree in Computer Science, Engineering, OR equivalent work experience.\n5+ years of experience in SRE or DevOps Engineering.\n2-5 years of experience in managing one or more SRE teams.\n3-5 years of experience in managing large-scale data analytics platforms that use Spark, Storm, or other frameworks.\n1-3 years of experience deploying and maintaining applications that are built using Docker and orchestrated on Kubernetes on Public or Private Cloud Providers.\n1-3 years of experience using Cloud Automation tools such as Terraform, Cluster API, or other frameworks.\n1-3 years of experience in Programing or scripting languages using Python, Go, Bash/Shell, or others.\n1-3 years of administrative operations knowledge in RDBMS such as Postgres and no-SQL such as Cassandra, MongoDB, or others\nShow experience in hiring and building high-performant SRE teams.\nShow the traits of being detail-oriented with strong time management and organization skills, and dedication to quality.\nExperienced with various debugging tools and troubleshooting performance bottlenecks at the infrastructure or at the application tier.\nGood to have experience with Config Management and automation using Ansible, Chef, Puppet, or others.\nExperienced with various Networking challenges and able to resolve networking bottlenecks at peak load.\nGood to have the knowledge of REST-based APIs and knows how to triage the request-response.\nAt Lucid, we don’t just welcome diversity - we celebrate it! Lucid Motors is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations.\n\nNotice regarding COVID-19 protocols\nAt Lucid, we prioritize the health and wellbeing of our employees, families, and friends above all else. In response to the novel Coronavirus all new Lucid employees, whose job will be based in the United States may or may not be required to provide original documentation confirming status as having received the prescribed inoculation (doses). Vaccination requirements are dependent upon location and position, please refer to the job description for more details.\nIndividuals in positions requiring vaccinations may seek a medical and/or religious exemption from this requirement and may be granted such an accommodation after submitting a formal request to and the subsequent review and approval thereof by our dedicated Covid-19 Response team.\nTo all recruitment agencies: Lucid Motors does not accept agency resumes. Please do not forward resumes to our careers alias or other Lucid Motors employees. Lucid Motors is not responsible for any fees related to unsolicited resumes."}, {"link": "https://sa.indeed.com/rc/clk?jk=bdc7e184b7672640&fccid=6576e7250aa78c3c&vjs=3", "location": "Riyadh", "title": "Analyst - Business Modelling - QuantumBlack", "company": "McKinsey & Company", "salary": NaN, "desc": "Who You'll Work With\nYou’ll be part of our QuantumBlack (QB) Client Capabilities Network (CCN) Analytics team at Riyadh working with the global QB-CCN Analytics team in providing analytics insights to consulting teams and clients in Saudi Arabia and across the globe. The team is predominantly composed of data analysts, data scientists, and data engineers who work across a variety of industries, functions and analytics methodologies.\nWhat You'll Do\nYou will work directly with the consulting teams and in some situations, with the client in the capacity of an Analytics Analyst where you will provide data mining and analytical support on client engagements, including conducting analysis, building data intensive models/tools, summarizing and interpreting results.\nDay to day tasks may include building prototypes/tools using Python/SQL to support business decision making (optimization, scenario planning, reporting). You will also work on managing data dashboards, graphs and visualizations leveraging tools like Tableau/Power BI. You may also be responsible for presenting results to mid level client management and implementing recommendations with client team members. You will also actively participate in building team's strategy on knowledge and capability development, exploring wider horizons both internally and externally to expand the service offerings of the team.\nYou will have the opportunity to gain new skills and build on the strengths you. Our analysts receive exceptional training as well as frequent coaching and mentoring from colleagues in their teams.\nQualifications\nPost-graduate or graduate degree in computer science, engineering, applied mathematics or related fields with an excellent academic record\n1+ years of practical work experience of building analytical models in data driven projects\nStrong knowledge of Python and any data visualization tool (e.g., Tableau, Power BI) required\nExperience of working with relational databases (e.g., MySQL, SQL Server, etc.); ability to identify needed data elements to support reporting requests\nPrior work experience in building or managing business algorithms/scenario planners/simulation engines to solve business problems a must\nKnowledge of statistical modelling and/or operations research techniques is an added benefit\nAbility to work collaboratively in a team environment and mentor junior members\nGood presentation and communication skills, and the ability to translate complex analytical concepts to business stakeholders"}, {"link": "https://sa.indeed.com/rc/clk?jk=6fbe36634eb1455c&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Lead Project Controller", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Project Controls\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 23, 2022\nUnposting Date\n: Oct 22, 2022\nReporting Manager Title : Senior Project Control Manager\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com\nManagement of Project, Cost, Planning and Scheduling systems\nDevelop and maintain the Integrated Timeline Schedule\nResponsible for establishing, implementing and maintaining Cost Breakdown Structure and Coding structures\nMonitoring, reporting and controlling project costs and schedule through all phases of the Project\nMonitoring project progress, status of the schedule and reporting on progress\nProducing schedule / status / trend / analysis schedule reports for the project management team\nCoordinates with PM on Project, Schedules, Forecast, Progress and Cost Review meetings\nReporting of the Project, both to NEOM and Worley management.\nMaintaining the Change Request Register utilizing the project Change Management process\n20 years of professional experience in related duties in the field of project controls.\nEngineering or relevant Degree\nPrimavera (P6)\nStrong analytical and mathematical skills\nStrong data interpretation skills\nWhat we offer you\nProviding an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.\n\nOur policy is to conduct background checks for all candidates who accept an offer of employment with us.\nIf you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley."}, {"link": "https://sa.indeed.com/rc/clk?jk=43566c1c6bbd4b57&fccid=b67ebe83591248fb&vjs=3", "location": "Riyadh", "title": "Paid Media Manager - Riyadh, Saudi Arabia", "company": "Assembly", "salary": NaN, "desc": "At Assembly, we help brands find the change to fuel business growth. We are an award-winning global brand performance agency, home to 1,500 talented people across 25 offices globally. We create unique data, technology and media solutions that enable faster and smarter problem solving and an inspired, collaborative workplace culture. Our clients include many of the best-known and best-loved brands across fashion and ecommerce.\nYou will also be a part of an organisation that has grown year on year since its establishment, we are currently a vibrant team of 125+ scaling rapidly through the MENA region with silos across Dubai, Cairo and Bangalore. We’ve gone through the lifecycle of being a global business start-up and are now truly a pan Middle Eastern enterprise. In addition to being a co-founding member of MENA Paid Media Team, if you would like to be a part of a diverse culture that consistently redefines digital identities and would be interesting in exploring further, we would love to hear from you. Check below job description:\n\nLead Strategy and work with Strategy Teams and client to develop and run successful Media campaigns and optimisations across all markets in scope with each client\nTaking ownership of the strategic client relationship and ensure this delivers high quality and effective campaigns across all relevant channels in scope\nManaging a range of resources to deliver effective marketing campaigns and programmes\nDemonstrate an in-depth practical knowledge of Best practice, Optimisation Framework, Account Structure, Bidding Strategy, Targeting types, and their application to campaigns to generate a high standard of delivery\nManagement of your direct reports to develop and guide them to gain promotions\nWorking with your direct reports and other relevant people within Assembly to produce actionable insights that meets and exceeds the clients business objectives\nProducing/developing campaigns\nActively seek creative and innovative media solutions\nManaging client budgets and project managing campaigns to ensure they are delivered on schedule and avoid missing deadlines\nDeveloping a trusting and productive relationships with clients. Ensuring the managers/executives in the team produce great daily, weekly and monthly meetings.\nDeveloping effective quarterly and yearly review sessions with key client stakeholders\nResponding to enquiries in a timely fashion and building trust by working in a consultative capacity using your expert industry knowledge\nAdvising on digital marketing strategies and helping the new business team by taking active roles in pitches\nWorking closely with the key functions within Clients Teams such as Account Management, Strategy and Business Intelligence.\nRequirements:\nArabic speaker with excellent command of English and Arabic\nRiyadh, Saudi Arabia based\nExcellent attention to detail\nInnate ability to take ownership of an account strategy\nExperience working with retail / fashion clients is desirable\nPassionate about Digital Marketing\nGood understanding of best practice across key platforms\nComfortable assessing staffing needs or delivering new staff inductions\nWorking knowledge of all channels and how they operate and interact\nCreate channel strategy, with a roadmap for initiatives and testing\nBenefits:\nOur Culture:\nWe’re able to bring meaningful change to our client's businesses because our people are empowered to lead and take ownership of their work. Autonomy and individuality are encouraged and highly celebrated at every level of our organization. To support our teams, we facilitate open and honest conversations across all levels of the organization to enable a strong collaborative culture on a global scale.\nCareer Development:\nOur people are our greatest assets. That’s why we believe in developing talent at all stages of their careers. With the incredible pace of change in brands, consumers, and technology, we focus on giving talent the tools to grow and evolve their skills beyond their immediate job functions. From media analysts to data scientists, to strategists, we empower our people with process and technology that gives them the freedom to think creatively and drive bold changes to client and agency business.\n\nWork With Global Brands:\nWe have the privilege of working with some of the most respected global brands across several verticals, including retail, fashion, luxury, travel, and technology.\n\nAdditional Information::\nAssembly is the modern alternative. We bring together data, talent, and tech to deliver global omnichannel media + business, technology, and data consulting solutions that help brands change as fast as the world around them. At the center of it all are our people who are our connectors, our growth drivers and our clients' most trusted partners. With over 1,500 employees in over 20 countries and 30 locations around the world, we bring a unified global approach with the local depth and expertise that enable brands to reach consumers anywhere they are. Assembly is a proud member of Stagwell, the challenger holding company built to transform marketing.\nWe’re a growing business with lots of room for incoming talent. We can’t wait to meet you."}, {"link": "https://sa.indeed.com/rc/clk?jk=b2ca9180427399ea&fccid=d9805af20a6c196e&vjs=3", "location": "Riyadh", "title": "Lead Piping Designer", "company": "Worley", "salary": NaN, "desc": "Company : Worley\nPrimary Location\n: SAU-ARD-Riyadh\nJob\n: Piping\nSchedule\n: Full-time\nEmployment Type : Employee\nJob Level : Experienced\nJob Posting\n: Aug 2, 2022\nUnposting Date\n: Oct 1, 2022\nReporting Manager Title : Project Engineering Manager\n:\n48,000 people. 49 countries. Over 120 office locations.\nWe’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com.\nWorley is currently looking for an experienced Lead Piping Designer to be part of our team on a project in Kingdom of Saudi Arabia.\n\nRESPONSIBILITIES:\nPRIMARY OBJECTIVE\nResponsible for performing plant layout and piping design activities using project approved 3D modelling and 2D drafting systems.\nSpecific Accountabilities:\no Produce the various discipline deliverables to the agreed schedule.\no Apply recognized engineering practices applicable to piping design and process plant layout.\nApply good interpersonal skills, liaising with members of other disciplines and departments.\nApply an awareness and willingness to work as a team member\nIf required, act as the discipline Lead on specific projects\nAble to work on multiple projects of various size and complexity\nQuality Assurance – work within the provisions and guidelines of the Quality Assurance systems.\nSafety – Responsible for personal safety and working within the Occupational Health & Safety procedures.\nWhere required, prepare or assist in the preparation of project documentation such as budgets, estimates, forecasts, schedules and reports.\nJOB SPECIFIC COMPETENCIES:\nHighly effective technical and practical design and drafting skills in the relevant discipline, and able to consistently deliver quality, accurate and timely work to Worley and its clients.\nCompetent in the use of relevant software such as PDMS, E3D, Plant 3D and highly competent in the use of these design software\nPro-active, goal oriented with excellent attention to detail.\nExcellent verbal and written communications skills, including the ability to convey information and ideas to individuals and groups, and make presentations when required.\nAble to work effectively in small to large multi-disciplinary teams and share and transfer knowledge within teams.\nQuality conscious - Establishes and maintains engineering documentation uniformity throughout the project,"}, {"link": "https://sa.indeed.com/rc/clk?jk=c17103ce2c180494&fccid=bafa4b35e9cd20ce&vjs=3", "location": "Riyadh", "title": "Senior Landscape Architect", "company": "AECOM", "salary": NaN, "desc": "Performing basic architectural/engineering calculations.\nPreparing specifications, reports and related data tables.\nMaintaining liaison with design and drafting groups.\nPreparing, reviewing, and approving drawings as required.\nUnder the direction of the Supervising Architect, may independently perform advanced technical assignments of various complexities within approved schedules and budgets.\nMay coordinate technical and administrative activities with employees in other disciplines and other departments participating on an assigned project.\nMay assist in the training and evaluation of assigned architectural and design/drafting personnel.\nMinimum Requirements\n\nTBC\n\nPreferred Qualifications\n\nTBC\n\nWhat We Offer\n\nWe will give you the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\n\nYou will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\n\nWe will encourage you to grow and develop your career with us through our technical and professional development programs and diverse career opportunities. We believe in leadership at all levels. No matter where you sit in the organization you can make a lasting impact on the projects you work on, the teams and committees you join and our business.\n\nWe offer competitive pay and benefits, well-being programs to support you and your family, and the development resources you need to advance your career.\n\nWhen you join us, you will connect and collaborate with a global network of experts – planners, designers, engineers, scientists, consultants, program and construction managers – leading the change toward a more sustainable and equitable future. Join us and let’s get started.\n\nAs an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours."}, {"link": "https://sa.indeed.com/rc/clk?jk=34ae70a9d9db44f8&fccid=63bc64d626783d2b&vjs=3", "location": "Riyadh", "title": "POST-DOCTORAL FELLOW", "company": "King Faisal Specialist Hospital and Research Centre", "salary": NaN, "desc": "Conducts research on a semi-independent basis such as design, perform and interpret experimental results; develops new ideas that promote current research; prepares and publishes scientific manuscripts under the direction of a higher level scientist; and attends and gives seminars.\nEssential Responsibilities and Duties\n1. Conducts research and laboratory experiments within a specified field, analyses and interprets results.\n2. Contributes efficiently and significantly to the planning of research projects.\n3. Develops new ideas and expertise that promote on-going research.\n4. Assists in manuscript writing for publication in scientific journals and/or presentations. May also assist in grant writing under the direction of a Scientist.\n5. Engages in appropriate training and professional development opportunities as required in order to enhance professional skills and research independence needed for pursuit of a career.\n6. Provides training and supervision to research staff.\n7. Assists in overseeing the laboratory including maintaining the supplies, equipment and ordering of necessary materials.\n8. Follows all laboratory safety rules and regulations.\n9. Follows all hospital related policies and procedures.\n10. Participates in self and others’ education, training and development, as applicable.\n11.Performs other related duties as assigned.\nEducation\nDoctorate Degree (e.g. PhD, MD, DDS, DVM) from an accredited institution in a scientific discipline relevant to the research field is required.\nExperience Required\nNo years of experience for Saudis or three (3) years post doctorate experience for non-Saudis as an independent professional within his/her field required\nOther Requirements(Certificates)\nA letter from immediate academic supervisor describing in details the candidate’s academic ability to learn, performance, hard work, punctuality, attitude towards work, taking responsibility, work under pressure, oral and written communication skills.\nFor in house scholarship recipients a satisfactory Annual Progress Report for the last two (2) years during scholarship that was requested by the Research Centre Training & Education Office/KFSH&RC Academic Training Affairs/Training & Education.\nStrength of the application’s Research Statement in which the candidate describes research interests, technical skills, and career goals.\nProven records of presenting original data generated from doctoral degree at least once in a national or international meeting."}, {"link": "https://sa.indeed.com/rc/clk?jk=d67c20362f3b2565&fccid=b67ebe83591248fb&vjs=3", "location": "Riyadh", "title": "Performance Media Lead", "company": "Assembly", "salary": NaN, "desc": "We are looking for a Head of KSA – Performance Marketing to help us build on our success in the\nMENA region. Key aspects of the role include delivering in-channel excellence for our clients,\ndeveloping our approach, and ensuring staff across KSA align, whilst also spearheading innovation\nand development of our paid media services. This is a fantastic opportunity to join the Assembly\nMENA adventure and to play a key role in supporting the ongoing growth and development of a\nglobal omnichannel agency.\n\nSome of the things we’d like you to do:\nOwn all paid media activation across KSA, leading teams consisting of performance and\ndigital marketing specialists.\nServe as a mentor, ensuring personal and talent development of our people is prioritised.\nIdentify client needs, resource requirements and opportunities then make hiring decisions\nand scale teams as required.\nDevelop and enhance our paid media proposition and approach, with a view to driving a\nconsistent offering across the KSA market whilst allowing for local nuances in each market.\nBring strategic leadership to key clients in the region and act as a point of escalation where\nrequired.\nTake a hands-on involvement in key pitches to help sell our products and services.\nCollaborate with colleagues in other regions to develop our global paid media viewpoint\nenabling cross-selling and collaboration.\n\nRequirements:\nThis role includes responsibility for leading diverse teams, our ideal candidate would have\nexperience in managing paid media teams and departments.\nExtensive knowledge of MENA channel landscape, including Search, Social & Display.\nSignificant agency-side experience within an entrepreneurial environment.\nExperienced in managing and organically growing a portfolio of clients across a variety of\nindustry sectors.\nExperience of running teams both face-to-face and remotely.\nStrong verbal and written communication skills in English and Arabic.\nBenefits:\nOur Culture:\nWe’re able to bring meaningful change to our client's businesses because our people are empowered to lead and take ownership of their work. Autonomy and individuality are encouraged and highly celebrated at every level of our organization. To support our teams, we facilitate open and honest conversations across all levels of the organization to enable a strong collaborative culture on a global scale.\nCareer Development:\nOur people are our greatest assets. That’s why we believe in developing talent at all stages of their careers. With the incredible pace of change in brands, consumers, and technology, we focus on giving talent the tools to grow and evolve their skills beyond their immediate job functions. From media analysts to data scientists, to strategists, we empower our people with process and technology that gives them the freedom to think creatively and drive bold changes to client and agency business.\n\nWork With Global Brands:\nWe have the privilege of working with some of the most respected global brands across several verticals, including retail, fashion, luxury, travel, and technology.\n\nAdditional Information::\nAssembly is the modern alternative. We bring together data, talent, and tech to deliver global omnichannel media + business, technology, and data consulting solutions that help brands change as fast as the world around them. At the center of it all are our people who are our connectors, our growth drivers and our clients' most trusted partners. With over 1,500 employees in over 20 countries and 30 locations around the world, we bring a unified global approach with the local depth and expertise that enable brands to reach consumers anywhere they are. Assembly is a proud member of Stagwell, the challenger holding company built to transform marketing.\n\nWe’re a growing business with lots of room for incoming talent. We can’t wait to meet you."}]