[{"link": "https://sa.indeed.com/rc/clk?jk=939bb390f0551031&fccid=e1614bd9cc003382&vjs=3", "location": "Jeddah", "title": "Data Scientist", "company": "Salla", "salary": NaN, "desc": "We are looking for a Data Scientist to design and develop Machine Learning (ML) models in different domains to find patterns from wide-variety types and large amounts of datasets. You will use mainly Deep Learning techniques (and other ML techniques) to solve different problems in Recommendation Engines, Chatbots, Natural Language Processing (NLP) and other domains. We will rely on you to build data products to extract valuable business insights. In this role, you should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research. Your goal will be to help our company analyze trends to make better decisions.\n\nResponsibilities\nAnalyze raw data: assessing quality, cleansing, preprocessing, structuring for downstream processing.\nConduct research and development activities, data exploration and discovery using Data Science and Machine Learning (ML) practices.\nDevelop, apply, test and implement Data Science and ML models for a wide variety of datasets gathered from different data sources such as Online market places, e-commerce platforms, social media, and web sources.\nDesign and develop accurate and scalable ML models in different domains and applications, which include, but not limited to, Recommendation engines, Chatbots, NLP, text mining, text-based feature selection/representation, optimization and predictive modeling.\nUtilize a variety of tools and approaches to solve complex business objectives, from Recommendation Engines, Chatbots, Natural Language Processing (NLP), Machine Learning/ Deep Learning, Image Processing, Speech Processing, Rule-Based Learning and Knowledge Graphs.\nDesign new service offerings and solutions in E-Commerce and different fields.\nKeep up to date with latest trends and technologies in the data science and ML fields.\nWork closely with business analysts and product development teams to understand and implement their requirements.\nCollaborate with big data and software developers to translate ideas, models and prototypes into full-fledged solutions.\nWork closely with cross-functional teams to identify challenges and problems and suggest potential AI solutions.\nRequirements\nBachelor's degree in quantative field (Statistics, Mathematics, Computer Science, Engineering, etc.); graduate degree in Data Science or other quantitative field is preferred.\nAt least 2 - 4 years' of experience as a data scientist (quantitative analytics and data modeling).\nDeep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms.\nExperience in ML applications and domains (Recommendation Engines, NLP and Chatbots experience is preferred).\nExperience in Deep Learning algorithms and techniques.\nProficiency in Python (other languages such as Shell Scripts, C++, .Net, Java, Matlab, R,...etc are preferred).-\nExperience in Python libraries (Tensorflow, Keras, Pandas, Sklearn).\nExcellent in Algorithms and Object-Oriented programming.\nFamiliarity with database technology (design and implementation) and query language.\nFamiliarity with Big Data frameworks and visualization tools (ElasticSearch, Cassandra, Hadoop, Spark) is preferred.\nStrong organizational and project management skills.\nGood problem-solving skills.\nExcellent communication and presentation skills\nBenefits\nMedical Health Insurance\nPerformance Bonus\nOthers"}, {"link": "https://sa.indeed.com/company/koraspond/jobs/Ux-Engineer-68e8795c17fb1815?fccid=b9caadfb761f8db2&vjs=3", "location": "Jeddah", "title": "UX Engineer (Remote Job)", "company": "Koraspond Digital Marketing", "salary": NaN, "desc": "As a UX engineer, you will deliver project wireframes with highly impactful & robust research practices and the generation of insights that guide the creation and optimization of highly compelling, useful, and engaging web experiences. you responsible for the creation of tests to identify issues with software before the product launch. Duties include identifying and analyzing any bugs and errors found during the test phase and documenting them for review after. Other tasks include developing and running new tests, reporting on the results and collaborating with software developers to fix program issues.\nYou will utilize usability tools and research methods to provide actionable insights that drive future design improvements. You will work to improve the usability, usefulness, and desirability of websites and applications. You should be extremely collaborative, and will require a high degree of social savvy, professionalism, and empathy for the customer.\nResponsibilities:\n· Plan and conduct research using the online platform, including project scoping, developing test flow, moderation (as required), data analysis, reporting, and team communication\n· Serve as the voice of the user, advocating for their needs and expectations to the wider team\n· Contribute to a set of shared artifacts such as Personas, Journey Maps, Metrics, and Research processes, which serve the broader team\n· Collect testing needs from internal clients, and determine priorities that are consistent with business goals and objectives. Proactively identify methods and solutions for how to improve the usability of business applications.\n· Advising the business when to involve user research and testing\n· Articulate company’s overall usability and user-centric vision across the organization\n· Ability to quickly learn and adapt in a fast-paced, highly interactive environment\n· Create tests to identify software problems and analyze bugs and errors found during tests\n· Document results of tests for the software development team\n· Recommend improvements in software to enhance user experience\n· Motivate the development process for efficiency and performance\n· Works together with the software developer to enhance and improve programs\n· Research and compare similar competitor products\n· Maintain updated knowledge of industry trends and advancements\nRequirements:\n· Extensive experience in software development and testing\n· High proficiency in computer technology and programming languages\n· Strong knowledge of Linux and Microsoft Windows\n· In-depth understanding of Java, Python, SQL, C++ and XML\n· Exceptional attention to detail\n· Excellent analytical and problem-solving skills\n· Good oral and written communication skills\n· Great team player and able to work efficiently with minimal supervision\n· Able to sit in front of a computer for long hours at a time\n· 4+ years of UX Research experience guiding design teams on usability best practices based on proven industry research and standards\n· Experience with one of the top user testing platforms or equivalent experience\n· Experience in researching and testing products and transactional experiences in an ongoing and rapid release cycle\n· Experience developing research goals for product usability\nJob Type: Full-time\nEducation:\nBachelor's (Preferred)\nExperience:\nUX Research: 4 years (Required)\nLanguage:\nEnglish (Preferred)\nApplication Deadline: 16/09/2022"}, {"link": "https://sa.indeed.com/rc/clk?jk=3e80fc31f96a97bc&fccid=b920aab5fd60595d&vjs=3", "location": "Riyadh", "title": "Senior Java Developer", "company": "Thales", "salary": NaN, "desc": "Location: Riyadh, Saudi Arabia\nThales people architect identity management and data protection solutions at the heart of digital security. Business and governments rely on us to bring trust to the billons of digital interactions they have with people. Our technologies and services help banks exchange funds, people cross borders, energy become smarter and much more. More than 30,000 organizations already rely on us to verify the identities of people and things, grant access to digital services, analyze vast quantities of information and encrypt data to make the connected world more secure.\nWe have been present in Saudi Arabia for 40 years and with over 600 employees to date, we are growing rapidly. Together we are delivering our signalling, control and train protection systems for the North –South Railway (NSR), the longest system of it’s kind in the world. Together we are key suppliers of In-flight entertainment and connectivity systems as well as air traffic management solutions in Saudi. We are making Saudi Arabia a safer place by securing the country’s critical infrastructure and e-security solutions that secure the country’s electronic payment systems. Thales has been selected to supply major electronic systems for air defence and the Group also supplied communication and optronic systems for the Army, the Saudi Arabia National Guards and the Air Force.\nExperience / Background :\nEngineering degree in Computer sciences\nFluent English and Arabic\nAt least 7 years as developer with Java/J2EE/WEB technologies\nProven experience in complex development projects\nAbility to design, develop, test & integrate complex component of software architecture\nTechnical Skills\nDevelopment experience using Java as a programming language\nExperience in Java EE technologies (JSP, Servlets, EJB, Spring, Web services, Micro Services)\nExperience in database skills (SQL, JDBC) using any RDBS (preferably Oracle)\nExperience in application servers (Websphere/JBoss) and/or Tomcat\nIT capabilities & knowledge (Windows platform/Unix platforms like AIX…)\nWillingness to travel to other countries as per the project needs\nTechnical Skills\nExperience in Smart Card technology & cryptography concepts\nExperience on Agile, CI/CD, and other methodologies\nDevelopment experience using C# as a programming language\nKey competencies :\nCritical thinking and problem solving skills\nAbility to work under pressure\nStrong adaptability & Stress tolerance\nTeam work and good communication skills\nStrong aptitude for learning new technologies quickly\nAt Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now!"}, {"link": "https://sa.indeed.com/rc/clk?jk=973e988b660fed8c&fccid=78f10670925c5ae8&vjs=3", "location": "Riyadh", "title": "Data Engineer", "company": "Denodo Technologies", "salary": NaN, "desc": "Company Description\n\nDenodo is a high-growth, market-leading enterprise software company backed by HGGC. We are recognized as a leader by Gartner and Forrester and uniquely positioned to address the data fragmentation problems that exist in many enterprises.\nWe thrive in dynamic environments, and at the risk of sounding cliché, we work hard, and we play hard. People at Denodo are builders at heart. Our global teams are constantly interacting and working together to empower people around the world, build community and connect in meaningful ways.\nDenodo's success is founded on being innovative and creative, on delivering the best solutions with the highest levels of customer satisfaction, and on having a unique piece of technology. A company can only be as forward-thinking as its people, which explains why we have become the leading developer of Data Virtualization, Data Services, and Cloud Data Integration technologies and solutions for the enterprise.\nAt Denodo, we are like a family and it is of the utmost importance to us that we help support your professional growth every step of the way.\n\nJob Description\n\nDenodo is looking for technical, passionate people to join our Services Engineering team. We want a professional who will consult, develop, train, and troubleshoot to enhance our clients’ journey around Data Virtualization.\n\nYour mission: to help Denodo users realize their full potential through accelerated adoption and productive use of Denodo solutions.\n\nIn this role, you will successfully employ a combination of high technical expertise and client management skills to conduct consulting, product implementation, and solutions development in either short or long-term engagements being the critical point of contact for getting things done among Denodo, partners, and client teams.\nDuties & Responsibilities\nAs a Data Engineer, you will use your technical expertise, troubleshooting, and communication skills between clients and internal Denodo teams to achieve your mission.\nObtain and maintain strong knowledge of the Denodo Platform and deliver a superb technical pitch, including our key and advanced features and benefits.\nConstantly learn new things and maintain an overview of modern technologies.\nBe able to address a majority of technical questions concerning customization, integration, enterprise architecture, and general features/functionality of our product.\nCapable of building and/or leading the development of custom deployments based on and beyond client’s requirements.\nProvide timely, prioritized, and complete customer-based feedback to Product Management, Sales, Support, and/or Development regarding client’s business cases, requirements, and issues.\nTrain and engage clients in the product architecture, configuration, and use of the Denodo Platform.\nPromote knowledge and best practices while managing deliverables and client expectations.\nManage client expectations, establish credibility at all levels within the client and build problem-solving partnerships with the client, partners, and colleagues.\nProvide technical consulting, training, and support.\nDevelop white papers, presentations, training materials, or documentation on related topics.\n\nQualifications\n\nRequired Skills\nBS or higher degree in Computer Science.\nSolid understanding of SQL and a good grasp of relational and analytical database management theory and practice.\nGood knowledge of JDBC, XML and Web Services APIs.\nFluent in English ( min. C1 Level ).\nExcellent verbal and written communication skills to be able to interact with technical and business counterparts.\nActive listener.\nStrong analytical and problem solving abilities.\nLots of curiosity. You never stop learning new things.\nCreativity. We love to be surprised with innovative solutions.\nBe a team worker with a positive attitude.\nWe Value\nExperience working with GIT or other version control systems.\nExperience working with BigData and/or noSQL environments like Hadoop, mongoDB, ...\nExperience in Windows & Linux (and UNIX) operating systems in server environments.\nExperience in Cloud services like AWS, Azure, Google Cloud...\nBusiness software implementation and integration projects (e.g. ETL/Data Warehouse architectures, CEP, BPM).\nIntegration with packaged applications (e.g. relational databases, SAP, Siebel, Oracle Financials, Business Intelligence tools, …).\nKnowledge in Java software development, especially in the database field.\nIndustry experience in supporting mission critical software components.\nExperience in attending customer meetings and writing technical documentation.\nForeign language skills are a plus.\nWillingness to travel on occasion.\nAvailability to work on-call weeks for a limited amount of time per year.\n\nAdditional Information\n\nEmployment Practices\nDenodo is an equal opportunity employer and prohibits discrimination and harassment of any kind. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by applicable law. Denodo will provide reasonable accommodation to employees who have protected disabilities in accordance with applicable law.\nWe do not accept resumes from headhunters or suppliers that have not signed a formal fee agreement. Therefore, any resume received from an unapproved supplier will be considered unsolicited, and we will not be obligated to pay a referral fee."}, {"link": "https://sa.indeed.com/rc/clk?jk=97d0b0cc6572027a&fccid=4a5126f2e3efbf1d&vjs=3", "location": "Riyadh", "title": "Senior Java Developer", "company": "2Soft Solutions", "salary": NaN, "desc": "We are hiring for one of our Information Technology & Services client, Review Job role and apply.\nPosition: Senior Java Developer\nLocation: Saudi Arabia-Riyadh\nExperience: 4 to 8 Years\nQualification : BE / B. Tech / MCA\nCompany: Please call back for details.\nRole:\nWe are seeking a Java developer responsible for building/maintaining java applications using core java, struts and Web Services. Your primary responsibility will be to maintain and develop our application (for esteemed client), and to coordinate with the rest of the team (offshore) working on different layers of the application. A commitment to collaborative problem solving, sophisticated design, and quality product is essential.\nJob Description:\nCore JAVA, Struts, Hibernate, JQuery, Apache Tomcat, JSON, Java script knowledge of XML Processing\nTranslating business requirements into well-engineered &tested application/ systems\nSystem designing, Documentation, Development & Coding\nLead a team of developers, provide direction as needed for resolution of issues, task prioritization, scheduling etc\nAssessing product requirements and functional specifications\nWork closely with technical team to support high availability services in all phases of the software development process.\nCollaborate with stake holders / business groups to design and implement systems that provide long term scalability, reliability, and performance\nDebugging, preparing test cases.\nApply if you interested on above position at precilla@2softsolutions.com along with following details:\nTotal Exp\nRelevant Exp\nCurrent CTC\nExpected CTC\nNotice Period\nPlease feel free to call me in case of any clarifications\nPrecilla S.\nSr. HR Executive\nT: +91-22-26843739 /40\nM: +91-9930071744\n2Soft Solutions Pvt Ltd\nHR Consulting. IT Recruitment. Staffing Solutions\nhttp://www.2softsolutions.com\nhttp://www.thejobcircle.com"}, {"link": "https://sa.indeed.com/rc/clk?jk=f81b5f1c6e84ac17&fccid=f879ea2dc53c0b5a&vjs=3", "location": "Riyadh", "title": "Android Development Associate Instructor (Onsite - Saudi Arabia)", "company": "CODING DOJO INC", "salary": NaN, "desc": "This is an onsite position to teach students in Riyadh, Saudi Arabia. Travel to the jobsite will be required and it will be a contract role for 4-6 months. All necessary business travel expenses will be handled by Coding Dojo.\n\nAs an Associate Instructor, you will be the backup instructor of your own cohort in the lead instructor's absence. This position includes training through more complex projects, on-line/on-site classroom support, teaching, lecturing, live demos and more. The position may include refining and creating courses to be released to Coding Dojo boot camp students.\nResponsibilities\nCreate content for program curriculum\nResponding to emails for the cohort (daily)\nReviewing lecture content and preparing to instruct the class if needed (daily)\nTaking attendance (if TA is not present, daily)\nAssisting with the morning session (daily)\nAssisting with the afternoon session (daily)\nMoving through online breakout rooms to assist students (daily)\nReviewing and leaving feedback on assignments (daily)\nDeliver instruction on program content\nFacilitate group discussions, demos, and in-class activities\nFollow industry trends in related program\nPlay a hands-on role in curriculum development, use what you learn from working with students to make the curriculum world-class\nGather and report on student metrics\nWork alongside Coding Dojo’s Online Instruction team to deliver remote training.\nParticipate in professional training to stay fresh\nResponsible for potential deployment with new or existing Coding Dojo clients with the ability to contextualize work based on client requests\nCore Competencies\nExperience in teaching, mentoring, industry training, online/classroom instruction\nExcellent oral and written communications skills\nMinimum Requirements\nBachelor's degree in Computer Science, Information Technology, or related field\n3+ years of Android development experience:\nProficient in the following technologies: Android Studio 4.0 / 4.1 (required), Android Jetpack, SQLite, Kotlin, Java programming\nWorking knowledge of the following: Gradle, Retrofit, Firebase, Room, Jetpack Compose, MVVM\nReliable internet connection and equipment to perform all job duties\nBenefits\nOnce-in-a-lifetime chance to travel to Riyadh, Saudi Arabia\nAll necessary travel expenses paid (plane ticket, living quarters, etc.)\nExcellent entry into portfolio/resume/CV\nSupport from world class network of teaching staff\nExperience the technology and skills without the stress of actual development/engineering\nBe a part of the mission to diversify the tech industry\nBe on the cutting edge of new program development\nWork with students and staff from around the world\nShare your experience and knowledge with future generations\nAbout Coding Dojo\nCoding Dojo is a global education technology company that offers a three full-stack web development Bootcamp, as well as courses on Data Science and other emerging technologies. Our innovative curriculum and Learning Management System is designed to train students to become self-sufficient developers, regardless of their technical background. We also make it our mission to support underserved communities and increase diversity in the tech industry.\nThis position is a rare opportunity to join a rapidly growing company and make a positive impact in many people's lives. At Coding Dojo we pride ourselves on possessing a culture of execution that caters to wavemakers rather than wave riders. If you are interested in joining a diverse and dynamic team who values speed, continuous improvement, measurement, focus, accountability, and “attacking the gap”, you will feel right at home at Coding Dojo.\nCoding Dojo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. Coding Dojo is committed to providing access, equal opportunity, and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities."}, {"link": "https://sa.indeed.com/rc/clk?jk=b4d41df0445355a3&fccid=f879ea2dc53c0b5a&vjs=3", "location": "Riyadh", "title": "Android Development Teaching Assistant (Onsite - Saudi Arabia)", "company": "CODING DOJO INC", "salary": NaN, "desc": "This is an onsite position to teach students in Riyadh, Saudi Arabia. Travel to the jobsite will be required and it will be a contract role for 4-6 months. All necessary business travel expenses will be handled by Coding Dojo.\n\nAs a Teaching Assistant, you will support the bootcamp instructors in teaching, lecturing, live demos and more. The position may include refining and creating courses to be released to Coding Dojo boot camp students.\nResponsibilities\nSupport Instructors by taking attendance, grading, and assisting with lectures, live demos, and labs\nConduct configuration reviews and provide feedback to students as necessary\nEnforce the 20-minute rule\nConduct frequent check-ins with students (every 20 minutes depending) to identify what students are working on, support their learning, and provide feedback\nCreate and sustain a fun atmosphere for learning\nSupport students remotely via Zoom & chat forums\nProvide student feedback to the instructor\nCore Competencies\nDesire to help and explain concepts to students\nEnthusiasm - exhibits passion and excitement overwork. Has a can-do attitude\nCalm under pressure - maintains stable performance even when under heavy pressure or stress\nIntelligence - demonstrates the ability to quickly and proficiently understand and absorb new information\nCommunication - can break down complex concepts in a simple, easy to understand the manner\nHumble - respectful of everyone\nExcellent oral and written communications skills\nMinimum Requirements\nBachelor's degree in Computer Science, Information Technology, or related field\n1+ years of Android development experience:\nProficient in the following technologies: Android Studio 4.0 / 4.1 (required), Android Jetpack, SQLite, Kotlin, Java programming\nWorking knowledge of the following: Gradle, Retrofit, Firebase, Room, Jetpack Compose, MVVM\nReliable internet connection and equipment to perform all job duties\nBenefits\nOnce-in-a-lifetime chance to travel to Riyadh, Saudi Arabia\nAll necessary travel expenses paid (plane ticket, living quarters, etc.)\nExcellent entry into portfolio/resume/CV\nSupport from world class network of teaching staff\nExperience the technology and skills without the stress of actual development/engineering\nBe a part of the mission to diversify the tech industry\nBe on the cutting edge of new program development\nWork with students and staff from around the world\nShare your experience and knowledge with future generations\nAbout Coding Dojo\nCoding Dojo is a global education technology company that offers a three full-stack web development Bootcamp, as well as courses on Data Science and other emerging technologies. Our innovative curriculum and Learning Management System is designed to train students to become self-sufficient developers, regardless of their technical background. We also make it our mission to support underserved communities and increase diversity in the tech industry.\nThis position is a rare opportunity to join a rapidly growing company and make a positive impact in many people's lives. At Coding Dojo we pride ourselves on possessing a culture of execution that caters to wavemakers rather than wave riders. If you are interested in joining a diverse and dynamic team who values speed, continuous improvement, measurement, focus, accountability, and “attacking the gap”, you will feel right at home at Coding Dojo.\nCoding Dojo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. Coding Dojo is committed to providing access, equal opportunity, and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities."}, {"link": "https://sa.indeed.com/rc/clk?jk=7959b5d00feff1e0&fccid=4b841d912d46e4fd&vjs=3", "location": "Riyadh", "title": "Pega Senior System Architect", "company": "Luxoft", "salary": NaN, "desc": "Project Description\nLuxoft is building a team of Pega Developers/Architects to work on banking and insurance projects. There will be an opportunity to work on BPM Development or BPM support involving Pega technology in various initiatives.\nResponsibilities\nAs part of a project team, resource will drive the design, architecture and implementation of Pega 7/8-based solutions. Resource will work as part of a project team to ensure that the business and technical architecture of the delivered solution matches customer requirements and, at times, mentor other project resources. a) In this role, resource will:\ni. Actively participate in the design, development and testing of the target industry framework(s) in different versions of Pega\nii. Review the work of junior team members and ensure it meets the required standards\niii. Drive new business growth and customer success by providing business expertise\niv. Act as a Subject Matter Expert to the organization Skills and Experience with a highly technical, hands-on, motivated and collaborative individual with exceptional communication skills and proven experience working with diverse teams of technical architects, business users and IT teams.\n\na)Resource must have demonstrated experience working with Pega technology and have achieved Pega CSSA Certification.\nb) Qualifications will include:\ni. Bachelor's degree in computer science, computer engineering or related field\nii. Pega CSSA/CLSA Certification\niii. 5+ progressive years of experience in building and implementing model-driven, enterprise-level business solutions and applications in PRPC\niv. Excellent time management and organization skills as well as the ability to manage multiple competing priorities\nv. Exceptional interpersonal skills and the ability to communicate, partner, and collaborate\nvi. Dedication to achieving outstanding customer results with a team-oriented drive and a demonstrated ability to lead by example\nvii. Exposure to a variety of technologies, including object-oriented techniques/principles, database design, application & web servers\nviii. Aptitude to pick up new concepts and technology rapidly; ability to explain it to both business & IT stakeholders\nix. Ability to match technology solutions to customer needs\nSkills\nMust have\nPega\nNice to have\nJava/SQL\nLanguages\nEnglish: B2 Upper Intermediate\nSeniority\nRegular\nRelocation package\nIf needed, we can help you with relocation process.\nVacancy Specialization\nBPM Pega\nRef Number\nVR-80137"}]